import React,{Component} from 'react'
import { Card ,Form,Input,Button,Cascader,message, notification} from 'antd';
import axios from 'axios'
import {connect} from 'dva'
import {routerRedux} from 'dva/router'
const FormItem=Form.Item
const { TextArea } = Input;
let flag=true
let time=true
let school
let schools=
   [
      {
          "value": "江苏省",
          "label": "江苏省",
          "children": [
              {
                  "value": "宿迁学院 2",
                  "label": "宿迁学院"
              },
              {
                  "value": "河海大学常州校区 17",
                  "label": "河海大学常州校区"
              },
              {
                  "value": "南京邮电大学 21",
                  "label": "南京邮电大学"
              },
              {
                  "value": "中国人民解放军陆军工程大学 26",
                  "label": "中国人民解放军陆军工程大学"
              },
              {
                  "value": "常州大学 43",
                  "label": "常州大学"
              },
              {
                  "value": "南京晓庄学院 177",
                  "label": "南京晓庄学院"
              },
              {
                  "value": "南京理工大学 178",
                  "label": "南京理工大学"
              },
              {
                  "value": "河海大学 179",
                  "label": "河海大学"
              },
              {
                  "value": "东南大学 180",
                  "label": "东南大学"
              },
              {
                  "value": "中国矿业大学 181",
                  "label": "中国矿业大学"
              },
              {
                  "value": "南京大学 182",
                  "label": "南京大学"
              },
              {
                  "value": "江南大学 183",
                  "label": "江南大学"
              },
              {
                  "value": "苏州大学 184",
                  "label": "苏州大学"
              },
              {
                  "value": "南京航空航天大学 185",
                  "label": "南京航空航天大学"
              },
              {
                  "value": "南京林业大学 308",
                  "label": "南京林业大学"
              },
              {
                  "value": "金陵科技学院 313",
                  "label": "金陵科技学院"
              },
              {
                  "value": "南京农业大学 314",
                  "label": "南京农业大学"
              },
              {
                  "value": "南京信息工程大学 315",
                  "label": "南京信息工程大学"
              },
              {
                  "value": "南京工业大学 316",
                  "label": "南京工业大学"
              },
              {
                  "value": "中国药科大学 411",
                  "label": "中国药科大学"
              },
              {
                  "value": "徐州医科大学 412",
                  "label": "徐州医科大学"
              },
              {
                  "value": "江苏理工学院 413",
                  "label": "江苏理工学院"
              },
              {
                  "value": "淮阴师范学院 414",
                  "label": "淮阴师范学院"
              },
              {
                  "value": "盐城师范学院 415",
                  "label": "盐城师范学院"
              },
              {
                  "value": "苏州科技大学 416",
                  "label": "苏州科技大学"
              },
              {
                  "value": "南京审计大学 417",
                  "label": "南京审计大学"
              },
              {
                  "value": "江苏警官学院 418",
                  "label": "江苏警官学院"
              },
              {
                  "value": "南京体育学院 419",
                  "label": "南京体育学院"
              },
              {
                  "value": "南京艺术学院 420",
                  "label": "南京艺术学院"
              },
              {
                  "value": "常熟理工学院 421",
                  "label": "常熟理工学院"
              },
              {
                  "value": "三江学院 422",
                  "label": "三江学院"
              },
              {
                  "value": "南京森林警察学院 423",
                  "label": "南京森林警察学院"
              },
              {
                  "value": "泰州学院 424",
                  "label": "泰州学院"
              },
              {
                  "value": "江苏第二师范学院 425",
                  "label": "江苏第二师范学院"
              },
              {
                  "value": "南京师范大学 435",
                  "label": "南京师范大学"
              },
              {
                  "value": "扬州大学 436",
                  "label": "扬州大学"
              },
              {
                  "value": "江苏大学 437",
                  "label": "江苏大学"
              },
              {
                  "value": "江苏科技大学 440",
                  "label": "江苏科技大学"
              },
              {
                  "value": "南京医科大学 443",
                  "label": "南京医科大学"
              },
              {
                  "value": "南京中医药大学 444",
                  "label": "南京中医药大学"
              },
              {
                  "value": "江苏师范大学 445",
                  "label": "江苏师范大学"
              },
              {
                  "value": "南京财经大学 446",
                  "label": "南京财经大学"
              },
              {
                  "value": "南通大学 447",
                  "label": "南通大学"
              },
              {
                  "value": "西交利物浦大学 448",
                  "label": "西交利物浦大学"
              },
              {
                  "value": "淮阴工学院 449",
                  "label": "淮阴工学院"
              },
              {
                  "value": "徐州工程学院 450",
                  "label": "徐州工程学院"
              },
              {
                  "value": "淮海工学院 451",
                  "label": "淮海工学院"
              },
              {
                  "value": "常州工学院 452",
                  "label": "常州工学院"
              },
              {
                  "value": "盐城工学院 453",
                  "label": "盐城工学院"
              },
              {
                  "value": "南京工程学院 454",
                  "label": "南京工程学院"
              },
              {
                  "value": "中国人民解放军海军指挥学院 1080",
                  "label": "中国人民解放军海军指挥学院"
              },
              {
                  "value": "中国人民解放军镇江船艇学院 1081",
                  "label": "中国人民解放军镇江船艇学院"
              },
              {
                  "value": "中国人民解放军南京政治学院 1082",
                  "label": "中国人民解放军南京政治学院"
              },
              {
                  "value": "中国人民解放军国际关系学院 1083",
                  "label": "中国人民解放军国际关系学院"
              },
              {
                  "value": "工程兵指挥学院 1085",
                  "label": "工程兵指挥学院"
              },
              {
                  "value": "南京陆军指挥学院 1086",
                  "label": "南京陆军指挥学院"
              },
              {
                  "value": "南京特殊教育师范学院 1088",
                  "label": "南京特殊教育师范学院"
              },
              {
                  "value": "徐州空军学院 1102",
                  "label": "徐州空军学院"
              },
              {
                  "value": "无锡太湖学院 1103",
                  "label": "无锡太湖学院"
              },
              {
                  "value": "南通理工学院 1105",
                  "label": "南通理工学院"
              },
              {
                  "value": "中国矿业大学徐海学院 1107",
                  "label": "中国矿业大学徐海学院"
              },
              {
                  "value": "南京理工大学泰州科技学院 1108",
                  "label": "南京理工大学泰州科技学院"
              },
              {
                  "value": "南京信息工程大学滨江学院 1109",
                  "label": "南京信息工程大学滨江学院"
              },
              {
                  "value": "苏州科技大学天平学院 1110",
                  "label": "苏州科技大学天平学院"
              },
              {
                  "value": "昆山杜克大学 1112",
                  "label": "昆山杜克大学"
              },
              {
                  "value": "常州大学怀德学院 1799",
                  "label": "常州大学怀德学院"
              },
              {
                  "value": "南京邮电大学通达学院 1800",
                  "label": "南京邮电大学通达学院"
              },
              {
                  "value": "江苏海事学院 1809",
                  "label": "江苏海事学院"
              },
              {
                  "value": "南京理工大学紫金学院 1969",
                  "label": "南京理工大学紫金学院"
              },
              {
                  "value": "南京大学金陵学院 1970",
                  "label": "南京大学金陵学院"
              }
          ]
      },
      {
          "value": "浙江省",
          "label": "浙江省",
          "children": [
              {
                  "value": "浙江工商大学 3",
                  "label": "浙江工商大学"
              },
              {
                  "value": "绍兴文理学院元培学院 6",
                  "label": "绍兴文理学院元培学院"
              },
              {
                  "value": "浙江财经大学 10",
                  "label": "浙江财经大学"
              },
              {
                  "value": "浙江工业大学之江学院 14",
                  "label": "浙江工业大学之江学院"
              },
              {
                  "value": "杭州师范大学 27",
                  "label": "杭州师范大学"
              },
              {
                  "value": "浙江中医药大学 34",
                  "label": "浙江中医药大学"
              },
              {
                  "value": "浙江农林大学 39",
                  "label": "浙江农林大学"
              },
              {
                  "value": "丽水学院 50",
                  "label": "丽水学院"
              },
              {
                  "value": "杭州电子科技大学信息工程学院 51",
                  "label": "杭州电子科技大学信息工程学院"
              },
              {
                  "value": "浙江理工大学 54",
                  "label": "浙江理工大学"
              },
              {
                  "value": "宁波工程学院 57",
                  "label": "宁波工程学院"
              },
              {
                  "value": "中国计量大学 58",
                  "label": "中国计量大学"
              },
              {
                  "value": "中国计量大学现代科技学院 61",
                  "label": "中国计量大学现代科技学院"
              },
              {
                  "value": "衢州学院 68",
                  "label": "衢州学院"
              },
              {
                  "value": "杭州电子科技大学 233",
                  "label": "杭州电子科技大学"
              },
              {
                  "value": "绍兴文理学院 234",
                  "label": "绍兴文理学院"
              },
              {
                  "value": "浙江大学城市学院 235",
                  "label": "浙江大学城市学院"
              },
              {
                  "value": "宁波大学 236",
                  "label": "宁波大学"
              },
              {
                  "value": "浙江科技学院 237",
                  "label": "浙江科技学院"
              },
              {
                  "value": "浙江工业大学 238",
                  "label": "浙江工业大学"
              },
              {
                  "value": "浙江大学宁波理工学院 239",
                  "label": "浙江大学宁波理工学院"
              },
              {
                  "value": "浙江师范大学 240",
                  "label": "浙江师范大学"
              },
              {
                  "value": "台州学院 241",
                  "label": "台州学院"
              },
              {
                  "value": "浙江万里学院 242",
                  "label": "浙江万里学院"
              },
              {
                  "value": "浙江大学 243",
                  "label": "浙江大学"
              },
              {
                  "value": "宁波诺丁汉大学 309",
                  "label": "宁波诺丁汉大学"
              },
              {
                  "value": "宁波大红鹰学院 311",
                  "label": "宁波大红鹰学院"
              },
              {
                  "value": "浙江传媒学院 466",
                  "label": "浙江传媒学院"
              },
              {
                  "value": "公安海警学院 467",
                  "label": "公安海警学院"
              },
              {
                  "value": "杭州科技职业技术学院 468",
                  "label": "杭州科技职业技术学院"
              },
              {
                  "value": "杭州万向职业技术学院 469",
                  "label": "杭州万向职业技术学院"
              },
              {
                  "value": "杭州医学院 470",
                  "label": "杭州医学院"
              },
              {
                  "value": "杭州职业技术学院 471",
                  "label": "杭州职业技术学院"
              },
              {
                  "value": "湖州师范学院 472",
                  "label": "湖州师范学院"
              },
              {
                  "value": "湖州职业技术学院 473",
                  "label": "湖州职业技术学院"
              },
              {
                  "value": "嘉兴南洋职业技术学院 474",
                  "label": "嘉兴南洋职业技术学院"
              },
              {
                  "value": "嘉兴学院 475",
                  "label": "嘉兴学院"
              },
              {
                  "value": "嘉兴学院南湖学院 476",
                  "label": "嘉兴学院南湖学院"
              },
              {
                  "value": "嘉兴职业技术学院 477",
                  "label": "嘉兴职业技术学院"
              },
              {
                  "value": "金华职业技术学院 478",
                  "label": "金华职业技术学院"
              },
              {
                  "value": "丽水职业技术学院 479",
                  "label": "丽水职业技术学院"
              },
              {
                  "value": "宁波城市职业技术学院 480",
                  "label": "宁波城市职业技术学院"
              },
              {
                  "value": "宁波卫生职业技术学院 481",
                  "label": "宁波卫生职业技术学院"
              },
              {
                  "value": "宁波职业技术学院 482",
                  "label": "宁波职业技术学院"
              },
              {
                  "value": "衢州职业技术学院 483",
                  "label": "衢州职业技术学院"
              },
              {
                  "value": "绍兴职业技术学院 484",
                  "label": "绍兴职业技术学院"
              },
              {
                  "value": "台州科技职业学院 485",
                  "label": "台州科技职业学院"
              },
              {
                  "value": "台州职业技术学院 486",
                  "label": "台州职业技术学院"
              },
              {
                  "value": "同济大学浙江学院 487",
                  "label": "同济大学浙江学院"
              },
              {
                  "value": "温州科技职业学院 488",
                  "label": "温州科技职业学院"
              },
              {
                  "value": "温州肯恩大学 489",
                  "label": "温州肯恩大学"
              },
              {
                  "value": "温州商学院 490",
                  "label": "温州商学院"
              },
              {
                  "value": "温州医科大学 491",
                  "label": "温州医科大学"
              },
              {
                  "value": "温州职业技术学院 492",
                  "label": "温州职业技术学院"
              },
              {
                  "value": "义乌工商职业技术学院 493",
                  "label": "义乌工商职业技术学院"
              },
              {
                  "value": "浙江安防职业技术学院 494",
                  "label": "浙江安防职业技术学院"
              },
              {
                  "value": "浙江电力职业技术学院 495",
                  "label": "浙江电力职业技术学院"
              },
              {
                  "value": "浙江东方职业技术学院 496",
                  "label": "浙江东方职业技术学院"
              },
              {
                  "value": "浙江纺织服装职业技术学院 497",
                  "label": "浙江纺织服装职业技术学院"
              },
              {
                  "value": "浙江工贸职业技术学院 498",
                  "label": "浙江工贸职业技术学院"
              },
              {
                  "value": "浙江工商职业技术学院 499",
                  "label": "浙江工商职业技术学院"
              },
              {
                  "value": "浙江工业职业技术学院 500",
                  "label": "浙江工业职业技术学院"
              },
              {
                  "value": "浙江广厦建设职业技术学院 501",
                  "label": "浙江广厦建设职业技术学院"
              },
              {
                  "value": "浙江国际海运职业技术学院 502",
                  "label": "浙江国际海运职业技术学院"
              },
              {
                  "value": "浙江海洋大学 503",
                  "label": "浙江海洋大学"
              },
              {
                  "value": "浙江横店影视职业学院 504",
                  "label": "浙江横店影视职业学院"
              },
              {
                  "value": "浙江机电职业技术学院 505",
                  "label": "浙江机电职业技术学院"
              },
              {
                  "value": "浙江建设职业技术学院 506",
                  "label": "浙江建设职业技术学院"
              },
              {
                  "value": "浙江交通职业技术学院 507",
                  "label": "浙江交通职业技术学院"
              },
              {
                  "value": "浙江金融职业学院 508",
                  "label": "浙江金融职业学院"
              },
              {
                  "value": "浙江经济职业技术学院 509",
                  "label": "浙江经济职业技术学院"
              },
              {
                  "value": "浙江经贸职业技术学院 510",
                  "label": "浙江经贸职业技术学院"
              },
              {
                  "value": "浙江警察学院 511",
                  "label": "浙江警察学院"
              },
              {
                  "value": "浙江警官职业学院 512",
                  "label": "浙江警官职业学院"
              },
              {
                  "value": "浙江旅游职业学院 513",
                  "label": "浙江旅游职业学院"
              },
              {
                  "value": "浙江农业商贸职业学院 514",
                  "label": "浙江农业商贸职业学院"
              },
              {
                  "value": "浙江汽车职业技术学院 515",
                  "label": "浙江汽车职业技术学院"
              },
              {
                  "value": "浙江商业职业技术学院 516",
                  "label": "浙江商业职业技术学院"
              },
              {
                  "value": "浙江树人学院 517",
                  "label": "浙江树人学院"
              },
              {
                  "value": "浙江水利水电学院 518",
                  "label": "浙江水利水电学院"
              },
              {
                  "value": "浙江特殊教育职业学院 519",
                  "label": "浙江特殊教育职业学院"
              },
              {
                  "value": "浙江体育职业技术学院 520",
                  "label": "浙江体育职业技术学院"
              },
              {
                  "value": "浙江同济科技职业学院 521",
                  "label": "浙江同济科技职业学院"
              },
              {
                  "value": "浙江外国语学院 522",
                  "label": "浙江外国语学院"
              },
              {
                  "value": "浙江医药高等专科学校 523",
                  "label": "浙江医药高等专科学校"
              },
              {
                  "value": "浙江艺术职业学院 524",
                  "label": "浙江艺术职业学院"
              },
              {
                  "value": "浙江音乐学院 525",
                  "label": "浙江音乐学院"
              },
              {
                  "value": "浙江邮电职业技术学院 526",
                  "label": "浙江邮电职业技术学院"
              },
              {
                  "value": "浙江育英职业技术学院 527",
                  "label": "浙江育英职业技术学院"
              },
              {
                  "value": "浙江越秀外国语学院 528",
                  "label": "浙江越秀外国语学院"
              },
              {
                  "value": "浙江长征职业技术学院 529",
                  "label": "浙江长征职业技术学院"
              },
              {
                  "value": "浙江舟山群岛新区旅游与健康职业学院 530",
                  "label": "浙江舟山群岛新区旅游与健康职业学院"
              },
              {
                  "value": "中国美术学院 531",
                  "label": "中国美术学院"
              },
              {
                  "value": "温州大学 1806",
                  "label": "温州大学"
              },
              {
                  "value": "温州大学瓯江学院 1807",
                  "label": "温州大学瓯江学院"
              },
              {
                  "value": "浙江师范大学行知学院 1818",
                  "label": "浙江师范大学行知学院"
              },
              {
                  "value": "浙江财经大学东方学院 1819",
                  "label": "浙江财经大学东方学院"
              }
          ]
      },
      {
          "value": "湖北省",
          "label": "湖北省",
          "children": [
              {
                  "value": "湖北工业大学 4",
                  "label": "湖北工业大学"
              },
              {
                  "value": "中国地质大学（武汉） 49",
                  "label": "中国地质大学（武汉）"
              },
              {
                  "value": "武汉工程大学 62",
                  "label": "武汉工程大学"
              },
              {
                  "value": "华中农业大学 151",
                  "label": "华中农业大学"
              },
              {
                  "value": "湖北民族学院 152",
                  "label": "湖北民族学院"
              },
              {
                  "value": "武汉科技大学 153",
                  "label": "武汉科技大学"
              },
              {
                  "value": "武汉大学 154",
                  "label": "武汉大学"
              },
              {
                  "value": "华中师范大学 155",
                  "label": "华中师范大学"
              },
              {
                  "value": "华中科技大学 156",
                  "label": "华中科技大学"
              },
              {
                  "value": "中南民族大学 157",
                  "label": "中南民族大学"
              },
              {
                  "value": "武汉理工大学 158",
                  "label": "武汉理工大学"
              },
              {
                  "value": "中国人民解放军海军工程大学 1113",
                  "label": "中国人民解放军海军工程大学"
              },
              {
                  "value": "中国人民解放军武汉军械士官学校 1114",
                  "label": "中国人民解放军武汉军械士官学校"
              },
              {
                  "value": "中国人民解放军军事经济学院 1115",
                  "label": "中国人民解放军军事经济学院"
              },
              {
                  "value": "通信指挥学院 1116",
                  "label": "通信指挥学院"
              },
              {
                  "value": "湖北第二师范学院 1117",
                  "label": "湖北第二师范学院"
              },
              {
                  "value": "荆楚理工学院 1118",
                  "label": "荆楚理工学院"
              },
              {
                  "value": "湖北科技学院 1119",
                  "label": "湖北科技学院"
              },
              {
                  "value": "湖北理工学院 1120",
                  "label": "湖北理工学院"
              },
              {
                  "value": "湖北文理学院 1121",
                  "label": "湖北文理学院"
              },
              {
                  "value": "武汉音乐学院 1123",
                  "label": "武汉音乐学院"
              },
              {
                  "value": "湖北工程学院 1124",
                  "label": "湖北工程学院"
              },
              {
                  "value": "湖北医药学院 1125",
                  "label": "湖北医药学院"
              },
              {
                  "value": "湖北汽车工业学院 1126",
                  "label": "湖北汽车工业学院"
              },
              {
                  "value": "武汉轻工大学 1127",
                  "label": "武汉轻工大学"
              },
              {
                  "value": "湖北中医药大学 1128",
                  "label": "湖北中医药大学"
              },
              {
                  "value": "武汉纺织大学 1129",
                  "label": "武汉纺织大学"
              },
              {
                  "value": "江汉大学 1133",
                  "label": "江汉大学"
              },
              {
                  "value": "三峡大学 1134",
                  "label": "三峡大学"
              },
              {
                  "value": "长江大学 1135",
                  "label": "长江大学"
              },
              {
                  "value": "湖北大学 1136",
                  "label": "湖北大学"
              },
              {
                  "value": "中南财经政法大学 1138",
                  "label": "中南财经政法大学"
              },
              {
                  "value": "武汉商学院 1146",
                  "label": "武汉商学院"
              },
              {
                  "value": "湖北美术学院 1147",
                  "label": "湖北美术学院"
              },
              {
                  "value": "武汉体育学院 1148",
                  "label": "武汉体育学院"
              },
              {
                  "value": "湖北警官学院 1149",
                  "label": "湖北警官学院"
              },
              {
                  "value": "湖北经济学院 1150",
                  "label": "湖北经济学院"
              },
              {
                  "value": "湖北师范大学 1151",
                  "label": "湖北师范大学"
              },
              {
                  "value": "黄冈师范学院 1152",
                  "label": "黄冈师范学院"
              },
              {
                  "value": "中国人民解放军第二炮兵指挥学院 1154",
                  "label": "中国人民解放军第二炮兵指挥学院"
              },
              {
                  "value": "中国人民解放军空军雷达学院 1155",
                  "label": "中国人民解放军空军雷达学院"
              },
              {
                  "value": "武汉华夏理工学院 1156",
                  "label": "武汉华夏理工学院"
              },
              {
                  "value": "武汉晴川学院 1157",
                  "label": "武汉晴川学院"
              },
              {
                  "value": "湖北商贸学院 1158",
                  "label": "湖北商贸学院"
              },
              {
                  "value": "武汉设计工程学院 1159",
                  "label": "武汉设计工程学院"
              },
              {
                  "value": "文华学院 1160",
                  "label": "文华学院"
              },
              {
                  "value": "武汉工程科技学院 1161",
                  "label": "武汉工程科技学院"
              },
              {
                  "value": "武昌理工学院 1162",
                  "label": "武昌理工学院"
              },
              {
                  "value": "武汉工商学院 1163",
                  "label": "武汉工商学院"
              },
              {
                  "value": "武汉东湖学院 1164",
                  "label": "武汉东湖学院"
              },
              {
                  "value": "汉口学院 1165",
                  "label": "汉口学院"
              },
              {
                  "value": "武汉生物工程学院 1166",
                  "label": "武汉生物工程学院"
              },
              {
                  "value": "武汉传媒学院 1167",
                  "label": "武汉传媒学院"
              },
              {
                  "value": "武昌工学院 1168",
                  "label": "武昌工学院"
              },
              {
                  "value": "武昌首义学院 1169",
                  "label": "武昌首义学院"
              },
              {
                  "value": "汉江师范学院 1170",
                  "label": "汉江师范学院"
              },
              {
                  "value": "武汉学院 1171",
                  "label": "武汉学院"
              },
              {
                  "value": "湖北生态工程职业技术学院 1968",
                  "label": "湖北生态工程职业技术学院"
              }
          ]
      },
      {
          "value": "四川省",
          "label": "四川省",
          "children": [
              {
                  "value": "西南石油大学 5",
                  "label": "西南石油大学"
              },
              {
                  "value": "西南民族大学 45",
                  "label": "西南民族大学"
              },
              {
                  "value": "成都信息工程大学 69",
                  "label": "成都信息工程大学"
              },
              {
                  "value": "西南交通大学峨眉校区 79",
                  "label": "西南交通大学峨眉校区"
              },
              {
                  "value": "西南交通大学 225",
                  "label": "西南交通大学"
              },
              {
                  "value": "四川大学 226",
                  "label": "四川大学"
              },
              {
                  "value": "西南科技大学 227",
                  "label": "西南科技大学"
              },
              {
                  "value": "乐山师范学院 228",
                  "label": "乐山师范学院"
              },
              {
                  "value": "电子科技大学 245",
                  "label": "电子科技大学"
              },
              {
                  "value": "西华师范大学 304",
                  "label": "西华师范大学"
              },
              {
                  "value": "成都大学 532",
                  "label": "成都大学"
              },
              {
                  "value": "阿坝师范学院 579",
                  "label": "阿坝师范学院"
              },
              {
                  "value": "成都工业学院 1367",
                  "label": "成都工业学院"
              },
              {
                  "value": "四川旅游学院 1368",
                  "label": "四川旅游学院"
              },
              {
                  "value": "四川农业大学 1369",
                  "label": "四川农业大学"
              },
              {
                  "value": "西南财经大学 1370",
                  "label": "西南财经大学"
              },
              {
                  "value": "成都师范学院 1373",
                  "label": "成都师范学院"
              },
              {
                  "value": "西昌学院 1374",
                  "label": "西昌学院"
              },
              {
                  "value": "成都学院 1375",
                  "label": "成都学院"
              },
              {
                  "value": "成都体育学院 1376",
                  "label": "成都体育学院"
              },
              {
                  "value": "四川警察学院 1377",
                  "label": "四川警察学院"
              },
              {
                  "value": "内江师范学院 1378",
                  "label": "内江师范学院"
              },
              {
                  "value": "四川文理学院 1379",
                  "label": "四川文理学院"
              },
              {
                  "value": "成都医学院 1381",
                  "label": "成都医学院"
              },
              {
                  "value": "川北医学院 1382",
                  "label": "川北医学院"
              },
              {
                  "value": "西南医科大学 1383",
                  "label": "西南医科大学"
              },
              {
                  "value": "四川理工学院 1385",
                  "label": "四川理工学院"
              },
              {
                  "value": "中国民用航空飞行学院 1387",
                  "label": "中国民用航空飞行学院"
              },
              {
                  "value": "四川师范大学 1389",
                  "label": "四川师范大学"
              },
              {
                  "value": "成都中医药大学 1390",
                  "label": "成都中医药大学"
              },
              {
                  "value": "西华大学 1392",
                  "label": "西华大学"
              },
              {
                  "value": "成都理工大学 1397",
                  "label": "成都理工大学"
              },
              {
                  "value": "攀枝花学院 1400",
                  "label": "攀枝花学院"
              },
              {
                  "value": "宜宾学院 1401",
                  "label": "宜宾学院"
              },
              {
                  "value": "绵阳师范学院 1402",
                  "label": "绵阳师范学院"
              },
              {
                  "value": "四川民族学院 1403",
                  "label": "四川民族学院"
              },
              {
                  "value": "四川音乐学院 1404",
                  "label": "四川音乐学院"
              },
              {
                  "value": "四川工商学院 1405",
                  "label": "四川工商学院"
              },
              {
                  "value": "成都文理学院 1406",
                  "label": "成都文理学院"
              },
              {
                  "value": "四川工业科技学院 1407",
                  "label": "四川工业科技学院"
              },
              {
                  "value": "成都东软学院 1408",
                  "label": "成都东软学院"
              },
              {
                  "value": "四川传媒学院 1409",
                  "label": "四川传媒学院"
              },
              {
                  "value": "西南交通大学希望学院 1410",
                  "label": "西南交通大学希望学院"
              },
              {
                  "value": "电子科技大学成都学院 1411",
                  "label": "电子科技大学成都学院"
              },
              {
                  "value": "四川大学锦江学院 1412",
                  "label": "四川大学锦江学院"
              }
          ]
      },
      {
          "value": "山东省",
          "label": "山东省",
          "children": [
              {
                  "value": "中国石油大学（华东） 7",
                  "label": "中国石油大学（华东）"
              },
              {
                  "value": "山东建筑大学 29",
                  "label": "山东建筑大学"
              },
              {
                  "value": "青岛理工大学 36",
                  "label": "青岛理工大学"
              },
              {
                  "value": "齐鲁工业大学 48",
                  "label": "齐鲁工业大学"
              },
              {
                  "value": "中国石油大学胜利学院 64",
                  "label": "中国石油大学胜利学院"
              },
              {
                  "value": "青岛农业大学 71",
                  "label": "青岛农业大学"
              },
              {
                  "value": "滨州学院 72",
                  "label": "滨州学院"
              },
              {
                  "value": "鲁东大学 89",
                  "label": "鲁东大学"
              },
              {
                  "value": "枣庄学院 95",
                  "label": "枣庄学院"
              },
              {
                  "value": "山东科技大学 195",
                  "label": "山东科技大学"
              },
              {
                  "value": "山东农业大学 196",
                  "label": "山东农业大学"
              },
              {
                  "value": "山东理工大学 197",
                  "label": "山东理工大学"
              },
              {
                  "value": "青岛大学 198",
                  "label": "青岛大学"
              },
              {
                  "value": "济南大学 199",
                  "label": "济南大学"
              },
              {
                  "value": "山东大学 200",
                  "label": "山东大学"
              },
              {
                  "value": "烟台大学 201",
                  "label": "烟台大学"
              },
              {
                  "value": "山东工商学院 202",
                  "label": "山东工商学院"
              },
              {
                  "value": "山东大学（威海） 203",
                  "label": "山东大学（威海）"
              },
              {
                  "value": "聊城大学 204",
                  "label": "聊城大学"
              },
              {
                  "value": "青岛科技大学 205",
                  "label": "青岛科技大学"
              },
              {
                  "value": "中国海洋大学 206",
                  "label": "中国海洋大学"
              },
              {
                  "value": "潍坊学院 310",
                  "label": "潍坊学院"
              },
              {
                  "value": "海军潜艇学院 908",
                  "label": "海军潜艇学院"
              },
              {
                  "value": "中国人民解放军海军航空工程学院 909",
                  "label": "中国人民解放军海军航空工程学院"
              },
              {
                  "value": "山东农业工程学院 910",
                  "label": "山东农业工程学院"
              },
              {
                  "value": "山东管理学院 911",
                  "label": "山东管理学院"
              },
              {
                  "value": "山东女子学院 912",
                  "label": "山东女子学院"
              },
              {
                  "value": "山东青年政治学院 913",
                  "label": "山东青年政治学院"
              },
              {
                  "value": "齐鲁师范学院 914",
                  "label": "齐鲁师范学院"
              },
              {
                  "value": "济宁学院 915",
                  "label": "济宁学院"
              },
              {
                  "value": "泰山学院 916",
                  "label": "泰山学院"
              },
              {
                  "value": "菏泽学院 919",
                  "label": "菏泽学院"
              },
              {
                  "value": "山东工艺美术学院 920",
                  "label": "山东工艺美术学院"
              },
              {
                  "value": "山东艺术学院 921",
                  "label": "山东艺术学院"
              },
              {
                  "value": "山东体育学院 922",
                  "label": "山东体育学院"
              },
              {
                  "value": "山东警察学院 923",
                  "label": "山东警察学院"
              },
              {
                  "value": "山东财经大学 925",
                  "label": "山东财经大学"
              },
              {
                  "value": "德州学院 926",
                  "label": "德州学院"
              },
              {
                  "value": "济宁医学院 931",
                  "label": "济宁医学院"
              },
              {
                  "value": "滨州医学院 932",
                  "label": "滨州医学院"
              },
              {
                  "value": "泰山医学院 933",
                  "label": "泰山医学院"
              },
              {
                  "value": "潍坊医学院 934",
                  "label": "潍坊医学院"
              },
              {
                  "value": "山东交通学院 935",
                  "label": "山东交通学院"
              },
              {
                  "value": "山东师范大学 937",
                  "label": "山东师范大学"
              },
              {
                  "value": "曲阜师范大学 944",
                  "label": "曲阜师范大学"
              },
              {
                  "value": "山东中医药大学 945",
                  "label": "山东中医药大学"
              },
              {
                  "value": "山东政法学院 954",
                  "label": "山东政法学院"
              },
              {
                  "value": "临沂大学 955",
                  "label": "临沂大学"
              },
              {
                  "value": "中国人民解放军第二炮兵青州士官学校 957",
                  "label": "中国人民解放军第二炮兵青州士官学校"
              },
              {
                  "value": "山东华宇工学院 958",
                  "label": "山东华宇工学院"
              },
              {
                  "value": "山东现代学院 959",
                  "label": "山东现代学院"
              },
              {
                  "value": "青岛工学院 960",
                  "label": "青岛工学院"
              },
              {
                  "value": "青岛黄海学院 961",
                  "label": "青岛黄海学院"
              },
              {
                  "value": "山东协和学院 962",
                  "label": "山东协和学院"
              },
              {
                  "value": "齐鲁理工学院 963",
                  "label": "齐鲁理工学院"
              },
              {
                  "value": "山东英才学院 964",
                  "label": "山东英才学院"
              },
              {
                  "value": "潍坊科技学院 965",
                  "label": "潍坊科技学院"
              },
              {
                  "value": "齐鲁医药学院 966",
                  "label": "齐鲁医药学院"
              },
              {
                  "value": "烟台南山学院 967",
                  "label": "烟台南山学院"
              },
              {
                  "value": "青岛滨海学院 968",
                  "label": "青岛滨海学院"
              },
              {
                  "value": "青岛恒星科技学院 969",
                  "label": "青岛恒星科技学院"
              },
              {
                  "value": "山东财经大学燕山学院 970",
                  "label": "山东财经大学燕山学院"
              },
              {
                  "value": "青岛农业大学海都学院 971",
                  "label": "青岛农业大学海都学院"
              },
              {
                  "value": "青岛理工大学琴岛学院 972",
                  "label": "青岛理工大学琴岛学院"
              },
              {
                  "value": "青岛科技大学中德科技学院 973",
                  "label": "青岛科技大学中德科技学院"
              }
          ]
      },
      {
          "value": "湖南省 ",
          "label": "湖南省 ",
          "children": [
              {
                  "value": "长沙理工大学 1",
                  "label": "长沙理工大学"
              },
              {
                  "value": "湖南工学院 8",
                  "label": "湖南工学院"
              },
              {
                  "value": "湖南工业大学 18",
                  "label": "湖南工业大学"
              },
              {
                  "value": "湖南科技大学 32",
                  "label": "湖南科技大学"
              },
              {
                  "value": "中南林业科技大学 44",
                  "label": "中南林业科技大学"
              },
              {
                  "value": "长沙学院 52",
                  "label": "长沙学院"
              },
              {
                  "value": "国防科技大学 88",
                  "label": "国防科技大学"
              },
              {
                  "value": "湖南中医药大学 91",
                  "label": "湖南中医药大学"
              },
              {
                  "value": "湖南城市学院 159",
                  "label": "湖南城市学院"
              },
              {
                  "value": "邵阳学院 160",
                  "label": "邵阳学院"
              },
              {
                  "value": "中南大学 162",
                  "label": "中南大学"
              },
              {
                  "value": "湖南师范大学 163",
                  "label": "湖南师范大学"
              },
              {
                  "value": "湖南文理学院 164",
                  "label": "湖南文理学院"
              },
              {
                  "value": "南华大学 165",
                  "label": "南华大学"
              },
              {
                  "value": "湖南商学院 166",
                  "label": "湖南商学院"
              },
              {
                  "value": "吉首大学 167",
                  "label": "吉首大学"
              },
              {
                  "value": "湖南农业大学 168",
                  "label": "湖南农业大学"
              },
              {
                  "value": "怀化学院 169",
                  "label": "怀化学院"
              },
              {
                  "value": "湘潭大学 170",
                  "label": "湘潭大学"
              },
              {
                  "value": "湖南大学  270",
                  "label": "湖南大学 "
              },
              {
                  "value": "长沙师范学院 1172",
                  "label": "长沙师范学院"
              },
              {
                  "value": "湖南人文科技学院 1173",
                  "label": "湖南人文科技学院"
              },
              {
                  "value": "湖南医药学院 1198",
                  "label": "湖南医药学院"
              },
              {
                  "value": "湖南警察学院 1199",
                  "label": "湖南警察学院"
              },
              {
                  "value": "湖南财政经济学院 1200",
                  "label": "湖南财政经济学院"
              },
              {
                  "value": "湖南女子学院 1201",
                  "label": "湖南女子学院"
              },
              {
                  "value": "湖南第一师范学院 1202",
                  "label": "湖南第一师范学院"
              },
              {
                  "value": "湖南科技学院 1205",
                  "label": "湖南科技学院"
              },
              {
                  "value": "湘南学院 1209",
                  "label": "湘南学院"
              },
              {
                  "value": "衡阳师范学院 1210",
                  "label": "衡阳师范学院"
              },
              {
                  "value": "湖南理工学院 1211",
                  "label": "湖南理工学院"
              },
              {
                  "value": "湖南工程学院 1212",
                  "label": "湖南工程学院"
              },
              {
                  "value": "长沙医学院 1228",
                  "label": "长沙医学院"
              },
              {
                  "value": "湖南交通工程学院 1229",
                  "label": "湖南交通工程学院"
              },
              {
                  "value": "湖南应用技术学院 1230",
                  "label": "湖南应用技术学院"
              },
              {
                  "value": "湖南涉外经济学院 1231",
                  "label": "湖南涉外经济学院"
              },
              {
                  "value": "长沙理工大学城南学院 1801",
                  "label": "长沙理工大学城南学院"
              },
              {
                  "value": "南华大学船山学院 1805",
                  "label": "南华大学船山学院"
              },
              {
                  "value": "东方科技学院 1808",
                  "label": "东方科技学院"
              },
              {
                  "value": "湖南理工大学 2063",
                  "label": "湖南理工大学"
              }
          ]
      },
      {
          "value": "江西省",
          "label": "江西省",
          "children": [
              {
                  "value": "江西理工大学 9",
                  "label": "江西理工大学"
              },
              {
                  "value": "江西财经大学（信息管理学院） 55",
                  "label": "江西财经大学（信息管理学院）"
              },
              {
                  "value": "江西财经大学（软通学院） 56",
                  "label": "江西财经大学（软通学院）"
              },
              {
                  "value": "东华理工大学 74",
                  "label": "东华理工大学"
              },
              {
                  "value": "南昌航空大学 85",
                  "label": "南昌航空大学"
              },
              {
                  "value": "江西理工大学南昌校区 93",
                  "label": "江西理工大学南昌校区"
              },
              {
                  "value": "江西师范大学 186",
                  "label": "江西师范大学"
              },
              {
                  "value": "华东交通大学 187",
                  "label": "华东交通大学"
              },
              {
                  "value": "九江学院 641",
                  "label": "九江学院"
              },
              {
                  "value": "宜春学院 642",
                  "label": "宜春学院"
              },
              {
                  "value": "南昌陆军学院 643",
                  "label": "南昌陆军学院"
              },
              {
                  "value": "南昌师范学院 644",
                  "label": "南昌师范学院"
              },
              {
                  "value": "景德镇学院 645",
                  "label": "景德镇学院"
              },
              {
                  "value": "萍乡学院 646",
                  "label": "萍乡学院"
              },
              {
                  "value": "江西警察学院 647",
                  "label": "江西警察学院"
              },
              {
                  "value": "新余学院 648",
                  "label": "新余学院"
              },
              {
                  "value": "井冈山大学 649",
                  "label": "井冈山大学"
              },
              {
                  "value": "江西科技师范大学 650",
                  "label": "江西科技师范大学"
              },
              {
                  "value": "赣南师范大学 651",
                  "label": "赣南师范大学"
              },
              {
                  "value": "上饶师范学院 652",
                  "label": "上饶师范学院"
              },
              {
                  "value": "赣南医学院 653",
                  "label": "赣南医学院"
              },
              {
                  "value": "江西中医药大学 654",
                  "label": "江西中医药大学"
              },
              {
                  "value": "南昌工程学院 655",
                  "label": "南昌工程学院"
              },
              {
                  "value": "景德镇陶瓷大学 656",
                  "label": "景德镇陶瓷大学"
              },
              {
                  "value": "江西财经大学 658",
                  "label": "江西财经大学"
              },
              {
                  "value": "江西农业大学 660",
                  "label": "江西农业大学"
              },
              {
                  "value": "南昌大学 663",
                  "label": "南昌大学"
              },
              {
                  "value": "江西工程学院 667",
                  "label": "江西工程学院"
              },
              {
                  "value": "江西应用科技学院 668",
                  "label": "江西应用科技学院"
              },
              {
                  "value": "江西科技学院 669",
                  "label": "江西科技学院"
              },
              {
                  "value": "南昌工学院 672",
                  "label": "南昌工学院"
              },
              {
                  "value": "江西服装学院 673",
                  "label": "江西服装学院"
              },
              {
                  "value": "南昌理工学院 674",
                  "label": "南昌理工学院"
              },
              {
                  "value": "南昌大学科学技术学院 1078",
                  "label": "南昌大学科学技术学院"
              },
              {
                  "value": "景德镇陶瓷大学科技艺术学院 1079",
                  "label": "景德镇陶瓷大学科技艺术学院"
              }
          ]
      },
      {
          "value": "河南省",
          "label": "河南省",
          "children": [
              {
                  "value": "郑州师范学院 12",
                  "label": "郑州师范学院"
              },
              {
                  "value": "河南工业大学 16",
                  "label": "河南工业大学"
              },
              {
                  "value": "河南理工大学 23",
                  "label": "河南理工大学"
              },
              {
                  "value": "中国人民解放军信息工程大学 42",
                  "label": "中国人民解放军信息工程大学"
              },
              {
                  "value": "平顶山学院 73",
                  "label": "平顶山学院"
              },
              {
                  "value": "郑州升达经贸管理学院 81",
                  "label": "郑州升达经贸管理学院"
              },
              {
                  "value": "河南大学软件学院 90",
                  "label": "河南大学软件学院"
              },
              {
                  "value": "南阳理工学院 136",
                  "label": "南阳理工学院"
              },
              {
                  "value": "安阳师范学院 137",
                  "label": "安阳师范学院"
              },
              {
                  "value": "河南大学 138",
                  "label": "河南大学"
              },
              {
                  "value": "郑州轻工业学院 139",
                  "label": "郑州轻工业学院"
              },
              {
                  "value": "河南农业大学 140",
                  "label": "河南农业大学"
              },
              {
                  "value": "郑州大学 141",
                  "label": "郑州大学"
              },
              {
                  "value": "南阳师范学院 142",
                  "label": "南阳师范学院"
              },
              {
                  "value": "解放军外国语学院 854",
                  "label": "解放军外国语学院"
              },
              {
                  "value": "防空兵指挥学院 856",
                  "label": "防空兵指挥学院"
              },
              {
                  "value": "郑州工程技术学院 858",
                  "label": "郑州工程技术学院"
              },
              {
                  "value": "河南财政金融学院 859",
                  "label": "河南财政金融学院"
              },
              {
                  "value": "信阳农林学院 860",
                  "label": "信阳农林学院"
              },
              {
                  "value": "河南牧业经济学院 861",
                  "label": "河南牧业经济学院"
              },
              {
                  "value": "河南工学院 862",
                  "label": "河南工学院"
              },
              {
                  "value": "铁道警察学院 863",
                  "label": "铁道警察学院"
              },
              {
                  "value": "河南警察学院 865",
                  "label": "河南警察学院"
              },
              {
                  "value": "新乡学院 867",
                  "label": "新乡学院"
              },
              {
                  "value": "许昌学院 868",
                  "label": "许昌学院"
              },
              {
                  "value": "洛阳理工学院 869",
                  "label": "洛阳理工学院"
              },
              {
                  "value": "河南工程学院 870",
                  "label": "河南工程学院"
              },
              {
                  "value": "黄淮学院 872",
                  "label": "黄淮学院"
              },
              {
                  "value": "河南科技学院 873",
                  "label": "河南科技学院"
              },
              {
                  "value": "洛阳师范学院 874",
                  "label": "洛阳师范学院"
              },
              {
                  "value": "周口师范学院 875",
                  "label": "周口师范学院"
              },
              {
                  "value": "商丘师范学院 876",
                  "label": "商丘师范学院"
              },
              {
                  "value": "信阳师范学院 878",
                  "label": "信阳师范学院"
              },
              {
                  "value": "新乡医学院 879",
                  "label": "新乡医学院"
              },
              {
                  "value": "河南中医药大学 880",
                  "label": "河南中医药大学"
              },
              {
                  "value": "华北水利水电大学 882",
                  "label": "华北水利水电大学"
              },
              {
                  "value": "河南财经政法大学 883",
                  "label": "河南财经政法大学"
              },
              {
                  "value": "河南师范大学 884",
                  "label": "河南师范大学"
              },
              {
                  "value": "河南科技大学 888",
                  "label": "河南科技大学"
              },
              {
                  "value": "河南城建学院 890",
                  "label": "河南城建学院"
              },
              {
                  "value": "郑州航空工业管理学院 891",
                  "label": "郑州航空工业管理学院"
              },
              {
                  "value": "安阳工学院 893",
                  "label": "安阳工学院"
              },
              {
                  "value": "中原工学院 894",
                  "label": "中原工学院"
              },
              {
                  "value": "安阳学院 895",
                  "label": "安阳学院"
              },
              {
                  "value": "郑州财经学院 896",
                  "label": "郑州财经学院"
              },
              {
                  "value": "黄河交通学院 897",
                  "label": "黄河交通学院"
              },
              {
                  "value": "商丘学院应用科技学院 898",
                  "label": "商丘学院应用科技学院"
              },
              {
                  "value": "商丘工学院 900",
                  "label": "商丘工学院"
              },
              {
                  "value": "郑州工商学院 901",
                  "label": "郑州工商学院"
              },
              {
                  "value": "信阳学院 902",
                  "label": "信阳学院"
              },
              {
                  "value": "郑州成功财经学院 903",
                  "label": "郑州成功财经学院"
              },
              {
                  "value": "郑州科技学院 904",
                  "label": "郑州科技学院"
              },
              {
                  "value": "郑州工业应用技术学院 905",
                  "label": "郑州工业应用技术学院"
              },
              {
                  "value": "黄河科技学院 906",
                  "label": "黄河科技学院"
              },
              {
                  "value": "中原工学院信息商务学院 907",
                  "label": "中原工学院信息商务学院"
              }
          ]
      },
      {
          "value": "天津市",
          "label": "天津市",
          "children": [
              {
                  "value": "天津理工大学 13",
                  "label": "天津理工大学"
              },
              {
                  "value": "天津大学仁爱学院 24",
                  "label": "天津大学仁爱学院"
              },
              {
                  "value": "天津大学 229",
                  "label": "天津大学"
              },
              {
                  "value": "天津工业大学 230",
                  "label": "天津工业大学"
              },
              {
                  "value": "南开大学 231",
                  "label": "南开大学"
              },
              {
                  "value": "中国人民解放军军事交通学院 708",
                  "label": "中国人民解放军军事交通学院"
              },
              {
                  "value": "天津职业技术师范大学 709",
                  "label": "天津职业技术师范大学"
              },
              {
                  "value": "天津农学院 710",
                  "label": "天津农学院"
              },
              {
                  "value": "天津商业大学 711",
                  "label": "天津商业大学"
              },
              {
                  "value": "天津财经大学 712",
                  "label": "天津财经大学"
              },
              {
                  "value": "天津师范大学 713",
                  "label": "天津师范大学"
              },
              {
                  "value": "天津中医药大学 714",
                  "label": "天津中医药大学"
              },
              {
                  "value": "天津科技大学 716",
                  "label": "天津科技大学"
              },
              {
                  "value": "中国民航大学 718",
                  "label": "中国民航大学"
              },
              {
                  "value": "天津美术学院 719",
                  "label": "天津美术学院"
              },
              {
                  "value": "天津音乐学院 720",
                  "label": "天津音乐学院"
              },
              {
                  "value": "天津体育学院 721",
                  "label": "天津体育学院"
              },
              {
                  "value": "天津外国语大学 722",
                  "label": "天津外国语大学"
              },
              {
                  "value": "天津城建大学 723",
                  "label": "天津城建大学"
              },
              {
                  "value": "天津医科大学 724",
                  "label": "天津医科大学"
              },
              {
                  "value": "天津天狮学院 735",
                  "label": "天津天狮学院"
              }
          ]
      },
      {
          "value": "辽宁省",
          "label": "辽宁省",
          "children": [
              {
                  "value": "大连理工大学开发区校区 19",
                  "label": "大连理工大学开发区校区"
              },
              {
                  "value": "沈阳航空航天大学 53",
                  "label": "沈阳航空航天大学"
              },
              {
                  "value": "沈阳化工大学 70",
                  "label": "沈阳化工大学"
              },
              {
                  "value": "辽宁科技大学 77",
                  "label": "辽宁科技大学"
              },
              {
                  "value": "东北大学 188",
                  "label": "东北大学"
              },
              {
                  "value": "沈阳师范大学 189",
                  "label": "沈阳师范大学"
              },
              {
                  "value": "大连海事大学 190",
                  "label": "大连海事大学"
              },
              {
                  "value": "大连理工大学 191",
                  "label": "大连理工大学"
              },
              {
                  "value": "鞍山师范学院 192",
                  "label": "鞍山师范学院"
              },
              {
                  "value": "辽宁大学 193",
                  "label": "辽宁大学"
              },
              {
                  "value": "大连大学 275",
                  "label": "大连大学"
              },
              {
                  "value": "大连民族大学 279",
                  "label": "大连民族大学"
              },
              {
                  "value": "沈阳建筑大学 533",
                  "label": "沈阳建筑大学"
              },
              {
                  "value": "渤海大学 534",
                  "label": "渤海大学"
              },
              {
                  "value": "大连工业大学 535",
                  "label": "大连工业大学"
              },
              {
                  "value": "大连海洋大学 536",
                  "label": "大连海洋大学"
              },
              {
                  "value": "大连交通大学 537",
                  "label": "大连交通大学"
              },
              {
                  "value": "大连外国语大学 538",
                  "label": "大连外国语大学"
              },
              {
                  "value": "大连医科大学 539",
                  "label": "大连医科大学"
              },
              {
                  "value": "东北财经大学 540",
                  "label": "东北财经大学"
              },
              {
                  "value": "海军大连舰艇学院 541",
                  "label": "海军大连舰艇学院"
              },
              {
                  "value": "锦州医科大学 542",
                  "label": "锦州医科大学"
              },
              {
                  "value": "辽东学院 543",
                  "label": "辽东学院"
              },
              {
                  "value": "辽宁工程技术大学 544",
                  "label": "辽宁工程技术大学"
              },
              {
                  "value": "辽宁工业大学 545",
                  "label": "辽宁工业大学"
              },
              {
                  "value": "辽宁警察学院 546",
                  "label": "辽宁警察学院"
              },
              {
                  "value": "辽宁科技学院 547",
                  "label": "辽宁科技学院"
              },
              {
                  "value": "辽宁师范大学 548",
                  "label": "辽宁师范大学"
              },
              {
                  "value": "辽宁石油化工大学 549",
                  "label": "辽宁石油化工大学"
              },
              {
                  "value": "辽宁中医药大学 550",
                  "label": "辽宁中医药大学"
              },
              {
                  "value": "鲁迅美术学院 551",
                  "label": "鲁迅美术学院"
              },
              {
                  "value": "沈阳大学 552",
                  "label": "沈阳大学"
              },
              {
                  "value": "沈阳工程学院 553",
                  "label": "沈阳工程学院"
              },
              {
                  "value": "沈阳工业大学 554",
                  "label": "沈阳工业大学"
              },
              {
                  "value": "沈阳理工大学 555",
                  "label": "沈阳理工大学"
              },
              {
                  "value": "沈阳农业大学 556",
                  "label": "沈阳农业大学"
              },
              {
                  "value": "沈阳炮兵学院 557",
                  "label": "沈阳炮兵学院"
              },
              {
                  "value": "沈阳体育学院 558",
                  "label": "沈阳体育学院"
              },
              {
                  "value": "沈阳药科大学 559",
                  "label": "沈阳药科大学"
              },
              {
                  "value": "沈阳医学院 560",
                  "label": "沈阳医学院"
              },
              {
                  "value": "沈阳音乐学院 561",
                  "label": "沈阳音乐学院"
              },
              {
                  "value": "营口理工学院 562",
                  "label": "营口理工学院"
              },
              {
                  "value": "中国人民解放军海军飞行学院 563",
                  "label": "中国人民解放军海军飞行学院"
              },
              {
                  "value": "中国刑事警察学院 564",
                  "label": "中国刑事警察学院"
              },
              {
                  "value": "中国医科大学 565",
                  "label": "中国医科大学"
              },
              {
                  "value": "大连东软信息学院 707",
                  "label": "大连东软信息学院"
              },
              {
                  "value": "辽宁理工学院 1537",
                  "label": "辽宁理工学院"
              },
              {
                  "value": "沈阳工学院 1538",
                  "label": "沈阳工学院"
              },
              {
                  "value": "大连财经学院 1539",
                  "label": "大连财经学院"
              },
              {
                  "value": "沈阳城市学院 1540",
                  "label": "沈阳城市学院"
              },
              {
                  "value": "辽宁传媒学院 1541",
                  "label": "辽宁传媒学院"
              },
              {
                  "value": "大连科技学院 1542",
                  "label": "大连科技学院"
              },
              {
                  "value": "大连艺术学院 1543",
                  "label": "大连艺术学院"
              },
              {
                  "value": "辽宁对外经贸学院 1544",
                  "label": "辽宁对外经贸学院"
              },
              {
                  "value": "辽宁财贸学院 1545",
                  "label": "辽宁财贸学院"
              },
              {
                  "value": "沈阳城市建设学院 1546",
                  "label": "沈阳城市建设学院"
              },
              {
                  "value": "辽宁何氏医学院 1547",
                  "label": "辽宁何氏医学院"
              },
              {
                  "value": "沈阳科技学院 1553",
                  "label": "沈阳科技学院"
              }
          ]
      },
      {
          "value": "广东省",
          "label": "广东省",
          "children": [
              {
                  "value": "广州大学华软软件学院 15",
                  "label": "广州大学华软软件学院"
              },
              {
                  "value": "广东药科大学 22",
                  "label": "广东药科大学"
              },
              {
                  "value": "北京师范大学珠海分校 28",
                  "label": "北京师范大学珠海分校"
              },
              {
                  "value": "北京理工大学珠海学院 30",
                  "label": "北京理工大学珠海学院"
              },
              {
                  "value": "中山大学新华学院 40",
                  "label": "中山大学新华学院"
              },
              {
                  "value": "广东财经大学 46",
                  "label": "广东财经大学"
              },
              {
                  "value": "广东海洋大学 86",
                  "label": "广东海洋大学"
              },
              {
                  "value": "华南理工大学软件学院 92",
                  "label": "华南理工大学软件学院"
              },
              {
                  "value": "广东外语外贸大学 123",
                  "label": "广东外语外贸大学"
              },
              {
                  "value": "暨南大学 124",
                  "label": "暨南大学"
              },
              {
                  "value": "肇庆学院 125",
                  "label": "肇庆学院"
              },
              {
                  "value": "电子科技大学中山学院 126",
                  "label": "电子科技大学中山学院"
              },
              {
                  "value": "汕头大学 127",
                  "label": "汕头大学"
              },
              {
                  "value": "广州大学 128",
                  "label": "广州大学"
              },
              {
                  "value": "中山大学 129",
                  "label": "中山大学"
              },
              {
                  "value": "广东工业大学 130",
                  "label": "广东工业大学"
              },
              {
                  "value": "华南农业大学 131",
                  "label": "华南农业大学"
              },
              {
                  "value": "华南理工大学计算机学院 132",
                  "label": "华南理工大学计算机学院"
              },
              {
                  "value": "深圳大学 133",
                  "label": "深圳大学"
              },
              {
                  "value": "东莞理工学院 134",
                  "label": "东莞理工学院"
              },
              {
                  "value": "华南理工大学 269",
                  "label": "华南理工大学"
              },
              {
                  "value": "华南师范大学 303",
                  "label": "华南师范大学"
              },
              {
                  "value": "星海音乐学院 1232",
                  "label": "星海音乐学院"
              },
              {
                  "value": "岭南师范学院 1233",
                  "label": "岭南师范学院"
              },
              {
                  "value": "海军兵种指挥学院 1235",
                  "label": "海军兵种指挥学院"
              },
              {
                  "value": "中国人民解放军军事体育进修学院 1236",
                  "label": "中国人民解放军军事体育进修学院"
              },
              {
                  "value": "广州航海学院 1237",
                  "label": "广州航海学院"
              },
              {
                  "value": "南方医科大学 1240",
                  "label": "南方医科大学"
              },
              {
                  "value": "广州中医药大学 1244",
                  "label": "广州中医药大学"
              },
              {
                  "value": "五邑大学 1247",
                  "label": "五邑大学"
              },
              {
                  "value": "南方科技大学 1254",
                  "label": "南方科技大学"
              },
              {
                  "value": "广东第二师范学院 1255",
                  "label": "广东第二师范学院"
              },
              {
                  "value": "佛山科学技术学院 1256",
                  "label": "佛山科学技术学院"
              },
              {
                  "value": "广东技术师范学院 1257",
                  "label": "广东技术师范学院"
              },
              {
                  "value": "广州美术学院 1258",
                  "label": "广州美术学院"
              },
              {
                  "value": "广州体育学院 1259",
                  "label": "广州体育学院"
              },
              {
                  "value": "广东警官学院 1260",
                  "label": "广东警官学院"
              },
              {
                  "value": "广东金融学院 1266",
                  "label": "广东金融学院"
              },
              {
                  "value": "韶关学院 1267",
                  "label": "韶关学院"
              },
              {
                  "value": "嘉应学院 1268",
                  "label": "嘉应学院"
              },
              {
                  "value": "韩山师范学院 1269",
                  "label": "韩山师范学院"
              },
              {
                  "value": "惠州学院 1270",
                  "label": "惠州学院"
              },
              {
                  "value": "广州医科大学 1272",
                  "label": "广州医科大学"
              },
              {
                  "value": "广东医科大学 1273",
                  "label": "广东医科大学"
              },
              {
                  "value": "仲恺农业工程学院 1274",
                  "label": "仲恺农业工程学院"
              },
              {
                  "value": "广东石油化工学院 1276",
                  "label": "广东石油化工学院"
              },
              {
                  "value": "广州商学院 1277",
                  "label": "广州商学院"
              },
              {
                  "value": "广东东软学院 1278",
                  "label": "广东东软学院"
              },
              {
                  "value": "广州工商学院 1279",
                  "label": "广州工商学院"
              },
              {
                  "value": "广东理工学院 1280",
                  "label": "广东理工学院"
              },
              {
                  "value": "广东培正学院 1281",
                  "label": "广东培正学院"
              },
              {
                  "value": "广东白云学院 1282",
                  "label": "广东白云学院"
              },
              {
                  "value": "广东科技学院 1283",
                  "label": "广东科技学院"
              },
              {
                  "value": "吉林大学珠海学院 1286",
                  "label": "吉林大学珠海学院"
              },
              {
                  "value": "中山大学南方学院 1287",
                  "label": "中山大学南方学院"
              },
              {
                  "value": "华南理工大学广州学院 1965",
                  "label": "华南理工大学广州学院"
              },
              {
                  "value": "哈尔滨工业大学(深圳) 2058",
                  "label": "哈尔滨工业大学(深圳)"
              }
          ]
      },
      {
          "value": "安徽省",
          "label": "安徽省",
          "children": [
              {
                  "value": "合肥工业大学宣城校区 25",
                  "label": "合肥工业大学宣城校区"
              },
              {
                  "value": "宿州学院 63",
                  "label": "宿州学院"
              },
              {
                  "value": "中国科学技术大学 98",
                  "label": "中国科学技术大学"
              },
              {
                  "value": "合肥学院 99",
                  "label": "合肥学院"
              },
              {
                  "value": "安徽大学 100",
                  "label": "安徽大学"
              },
              {
                  "value": "阜阳师范学院 101",
                  "label": "阜阳师范学院"
              },
              {
                  "value": "合肥工业大学 102",
                  "label": "合肥工业大学"
              },
              {
                  "value": "海军蚌埠士官学校 1001",
                  "label": "海军蚌埠士官学校"
              },
              {
                  "value": "中国人民解放军汽车管理学院 1002",
                  "label": "中国人民解放军汽车管理学院"
              },
              {
                  "value": "中国人民解放军装甲兵学院 1003",
                  "label": "中国人民解放军装甲兵学院"
              },
              {
                  "value": "解放军电子工程学院 1004",
                  "label": "解放军电子工程学院"
              },
              {
                  "value": "陆军炮兵防空兵学院 1005",
                  "label": "陆军炮兵防空兵学院"
              },
              {
                  "value": "亳州学院 1008",
                  "label": "亳州学院"
              },
              {
                  "value": "池州学院 1009",
                  "label": "池州学院"
              },
              {
                  "value": "蚌埠学院 1010",
                  "label": "蚌埠学院"
              },
              {
                  "value": "铜陵学院 1012",
                  "label": "铜陵学院"
              },
              {
                  "value": "滁州学院 1013",
                  "label": "滁州学院"
              },
              {
                  "value": "皖西学院 1014",
                  "label": "皖西学院"
              },
              {
                  "value": "黄山学院 1015",
                  "label": "黄山学院"
              },
              {
                  "value": "巢湖学院 1017",
                  "label": "巢湖学院"
              },
              {
                  "value": "淮南师范学院 1018",
                  "label": "淮南师范学院"
              },
              {
                  "value": "安庆师范大学 1019",
                  "label": "安庆师范大学"
              },
              {
                  "value": "安徽科技学院 1020",
                  "label": "安徽科技学院"
              },
              {
                  "value": "蚌埠医学院 1022",
                  "label": "蚌埠医学院"
              },
              {
                  "value": "合肥师范学院 1023",
                  "label": "合肥师范学院"
              },
              {
                  "value": "皖南医学院 1024",
                  "label": "皖南医学院"
              },
              {
                  "value": "安徽中医药大学 1025",
                  "label": "安徽中医药大学"
              },
              {
                  "value": "安徽建筑大学 1026",
                  "label": "安徽建筑大学"
              },
              {
                  "value": "淮北师范大学 1027",
                  "label": "淮北师范大学"
              },
              {
                  "value": "安徽工程大学 1033",
                  "label": "安徽工程大学"
              },
              {
                  "value": "安徽财经大学 1034",
                  "label": "安徽财经大学"
              },
              {
                  "value": "安徽师范大学 1035",
                  "label": "安徽师范大学"
              },
              {
                  "value": "安徽医科大学 1036",
                  "label": "安徽医科大学"
              },
              {
                  "value": "安徽工业大学 1037",
                  "label": "安徽工业大学"
              },
              {
                  "value": "安徽农业大学 1038",
                  "label": "安徽农业大学"
              },
              {
                  "value": "安徽理工大学 1039",
                  "label": "安徽理工大学"
              },
              {
                  "value": "安徽外国语学院 1041",
                  "label": "安徽外国语学院"
              },
              {
                  "value": "安徽文达信息工程学院 1042",
                  "label": "安徽文达信息工程学院"
              },
              {
                  "value": "安徽信息工程学院 1043",
                  "label": "安徽信息工程学院"
              },
              {
                  "value": "安徽新华学院 1044",
                  "label": "安徽新华学院"
              },
              {
                  "value": "安徽三联学院 1045",
                  "label": "安徽三联学院"
              }
          ]
      },
      {
          "value": "北京市",
          "label": "北京市",
          "children": [
              {
                  "value": "中国传媒大学 37",
                  "label": "中国传媒大学"
              },
              {
                  "value": "北京信息科技大学 38",
                  "label": "北京信息科技大学"
              },
              {
                  "value": "中国石油大学（北京） 41",
                  "label": "中国石油大学（北京）"
              },
              {
                  "value": "中国地质大学（北京） 60",
                  "label": "中国地质大学（北京）"
              },
              {
                  "value": "中国科学院大学 96",
                  "label": "中国科学院大学"
              },
              {
                  "value": "北京师范大学 103",
                  "label": "北京师范大学"
              },
              {
                  "value": "北京电子科技学院 104",
                  "label": "北京电子科技学院"
              },
              {
                  "value": "北京林业大学 105",
                  "label": "北京林业大学"
              },
              {
                  "value": "北京工业大学 106",
                  "label": "北京工业大学"
              },
              {
                  "value": "清华大学 107",
                  "label": "清华大学"
              },
              {
                  "value": "北京大学 108",
                  "label": "北京大学"
              },
              {
                  "value": "北京航空航天大学 109",
                  "label": "北京航空航天大学"
              },
              {
                  "value": "北京化工大学 110",
                  "label": "北京化工大学"
              },
              {
                  "value": "北京理工大学软件学院 111",
                  "label": "北京理工大学软件学院"
              },
              {
                  "value": "北京理工大学 112",
                  "label": "北京理工大学"
              },
              {
                  "value": "北京邮电大学 113",
                  "label": "北京邮电大学"
              },
              {
                  "value": "北京交通大学 114",
                  "label": "北京交通大学"
              },
              {
                  "value": "首都师范大学 115",
                  "label": "首都师范大学"
              },
              {
                  "value": "北京警察学院 1687",
                  "label": "北京警察学院"
              },
              {
                  "value": "中国人民解放军装甲兵工程学院 1688",
                  "label": "中国人民解放军装甲兵工程学院"
              },
              {
                  "value": "中国人民解放军装备指挥技术学院 1689",
                  "label": "中国人民解放军装备指挥技术学院"
              },
              {
                  "value": "陆军航空兵学院 1690",
                  "label": "陆军航空兵学院"
              },
              {
                  "value": "防化指挥工程学院 1691",
                  "label": "防化指挥工程学院"
              },
              {
                  "value": "中国人民解放军国防大学 1692",
                  "label": "中国人民解放军国防大学"
              },
              {
                  "value": "首钢工学院 1694",
                  "label": "首钢工学院"
              },
              {
                  "value": "首都经济贸易大学 1695",
                  "label": "首都经济贸易大学"
              },
              {
                  "value": "北京建筑大学 1696",
                  "label": "北京建筑大学"
              },
              {
                  "value": "北京石油化工学院 1697",
                  "label": "北京石油化工学院"
              },
              {
                  "value": "国际关系学院 1698",
                  "label": "国际关系学院"
              },
              {
                  "value": "首都体育学院 1699",
                  "label": "首都体育学院"
              },
              {
                  "value": "北京第二外国语学院 1700",
                  "label": "北京第二外国语学院"
              },
              {
                  "value": "中国青年政治学院 1701",
                  "label": "中国青年政治学院"
              },
              {
                  "value": "外交学院 1702",
                  "label": "外交学院"
              },
              {
                  "value": "北方工业大学 1703",
                  "label": "北方工业大学"
              },
              {
                  "value": "北京联合大学 1704",
                  "label": "北京联合大学"
              },
              {
                  "value": "首都医科大学 1706",
                  "label": "首都医科大学"
              },
              {
                  "value": "北京工商大学 1707",
                  "label": "北京工商大学"
              },
              {
                  "value": "中华女子学院 1708",
                  "label": "中华女子学院"
              },
              {
                  "value": "中国矿业大学(北京) 1709",
                  "label": "中国矿业大学(北京)"
              },
              {
                  "value": "中央戏剧学院 1710",
                  "label": "中央戏剧学院"
              },
              {
                  "value": "中央美术学院 1711",
                  "label": "中央美术学院"
              },
              {
                  "value": "北京电影学院 1712",
                  "label": "北京电影学院"
              },
              {
                  "value": "中国戏曲学院 1713",
                  "label": "中国戏曲学院"
              },
              {
                  "value": "北京舞蹈学院 1717",
                  "label": "北京舞蹈学院"
              },
              {
                  "value": "中国音乐学院 1718",
                  "label": "中国音乐学院"
              },
              {
                  "value": "北京物资学院 1719",
                  "label": "北京物资学院"
              },
              {
                  "value": "北京体育大学 1722",
                  "label": "北京体育大学"
              },
              {
                  "value": "华北电力大学 1723",
                  "label": "华北电力大学"
              },
              {
                  "value": "中央财经大学 1724",
                  "label": "中央财经大学"
              },
              {
                  "value": "中国政法大学 1725",
                  "label": "中国政法大学"
              },
              {
                  "value": "北京外国语大学 1726",
                  "label": "北京外国语大学"
              },
              {
                  "value": "北京中医药大学 1727",
                  "label": "北京中医药大学"
              },
              {
                  "value": "对外经济贸易大学 1728",
                  "label": "对外经济贸易大学"
              },
              {
                  "value": "中央音乐学院 1729",
                  "label": "中央音乐学院"
              },
              {
                  "value": "中央民族大学 1731",
                  "label": "中央民族大学"
              },
              {
                  "value": "中国农业大学 1734",
                  "label": "中国农业大学"
              },
              {
                  "value": "北京科技大学 1737",
                  "label": "北京科技大学"
              },
              {
                  "value": "中国人民大学 1742",
                  "label": "中国人民大学"
              },
              {
                  "value": "中国劳动关系学院 1746",
                  "label": "中国劳动关系学院"
              },
              {
                  "value": "北京协和医学院 1748",
                  "label": "北京协和医学院"
              },
              {
                  "value": "中国人民公安大学 1749",
                  "label": "中国人民公安大学"
              },
              {
                  "value": "北京语言大学 1750",
                  "label": "北京语言大学"
              },
              {
                  "value": "北京印刷学院 1753",
                  "label": "北京印刷学院"
              },
              {
                  "value": "北京服装学院 1754",
                  "label": "北京服装学院"
              },
              {
                  "value": "北京农学院 1755",
                  "label": "北京农学院"
              },
              {
                  "value": "空军指挥学院 1756",
                  "label": "空军指挥学院"
              },
              {
                  "value": "中国人民解放军后勤指挥学院 1757",
                  "label": "中国人民解放军后勤指挥学院"
              },
              {
                  "value": "中国人民解放军艺术学院 1758",
                  "label": "中国人民解放军艺术学院"
              },
              {
                  "value": "北京城市学院 1759",
                  "label": "北京城市学院"
              },
              {
                  "value": "北京吉利学院 1760",
                  "label": "北京吉利学院"
              },
              {
                  "value": "北京邮电大学世纪学院 1761",
                  "label": "北京邮电大学世纪学院"
              }
          ]
      },
      {
          "value": "福建省",
          "label": "福建省",
          "children": [
              {
                  "value": "厦门理工学院 31",
                  "label": "厦门理工学院"
              },
              {
                  "value": "闽南师范大学 33",
                  "label": "闽南师范大学"
              },
              {
                  "value": "厦门大学 116",
                  "label": "厦门大学"
              },
              {
                  "value": "泉州师范学院 117",
                  "label": "泉州师范学院"
              },
              {
                  "value": "福建农林大学 118",
                  "label": "福建农林大学"
              },
              {
                  "value": "福建师范大学 119",
                  "label": "福建师范大学"
              },
              {
                  "value": "华侨大学 120",
                  "label": "华侨大学"
              },
              {
                  "value": "福州大学 121",
                  "label": "福州大学"
              },
              {
                  "value": "福建工程学院 122",
                  "label": "福建工程学院"
              },
              {
                  "value": "集美大学 675",
                  "label": "集美大学"
              },
              {
                  "value": "宁德师范学院 676",
                  "label": "宁德师范学院"
              },
              {
                  "value": "福建江夏学院 677",
                  "label": "福建江夏学院"
              },
              {
                  "value": "福建警察学院 678",
                  "label": "福建警察学院"
              },
              {
                  "value": "武夷学院 679",
                  "label": "武夷学院"
              },
              {
                  "value": "三明学院 680",
                  "label": "三明学院"
              },
              {
                  "value": "闽江学院 681",
                  "label": "闽江学院"
              },
              {
                  "value": "莆田学院 682",
                  "label": "莆田学院"
              },
              {
                  "value": "龙岩学院 683",
                  "label": "龙岩学院"
              },
              {
                  "value": "福建中医药大学 688",
                  "label": "福建中医药大学"
              },
              {
                  "value": "福建医科大学 690",
                  "label": "福建医科大学"
              },
              {
                  "value": "厦门医学院 696",
                  "label": "厦门医学院"
              },
              {
                  "value": "阳光学院 697",
                  "label": "阳光学院"
              },
              {
                  "value": "厦门工学院 698",
                  "label": "厦门工学院"
              },
              {
                  "value": "福州理工学院 699",
                  "label": "福州理工学院"
              },
              {
                  "value": "泉州信息工程学院 700",
                  "label": "泉州信息工程学院"
              },
              {
                  "value": "福州外语外贸学院 701",
                  "label": "福州外语外贸学院"
              },
              {
                  "value": "闽南理工学院 702",
                  "label": "闽南理工学院"
              },
              {
                  "value": "仰恩大学 705",
                  "label": "仰恩大学"
              },
              {
                  "value": "厦门华厦学院 706",
                  "label": "厦门华厦学院"
              },
              {
                  "value": "福建商学院 1625",
                  "label": "福建商学院"
              },
              {
                  "value": "福州大学至诚学院 1626",
                  "label": "福州大学至诚学院"
              },
              {
                  "value": "集美大学诚毅学院 1627",
                  "label": "集美大学诚毅学院"
              },
              {
                  "value": "厦门大学嘉庚学院 2064",
                  "label": "厦门大学嘉庚学院"
              }
          ]
      },
      {
          "value": "山西省",
          "label": "山西省",
          "children": [
              {
                  "value": "中北大学 35",
                  "label": "中北大学"
              },
              {
                  "value": "太原理工大学 207",
                  "label": "太原理工大学"
              },
              {
                  "value": "山西大学商务学院 974",
                  "label": "山西大学商务学院"
              },
              {
                  "value": "长治学院 975",
                  "label": "长治学院"
              },
              {
                  "value": "吕梁学院 976",
                  "label": "吕梁学院"
              },
              {
                  "value": "山西工程技术学院 977",
                  "label": "山西工程技术学院"
              },
              {
                  "value": "山西传媒学院 978",
                  "label": "山西传媒学院"
              },
              {
                  "value": "忻州师范学院 979",
                  "label": "忻州师范学院"
              },
              {
                  "value": "晋中学院 980",
                  "label": "晋中学院"
              },
              {
                  "value": "太原师范学院 981",
                  "label": "太原师范学院"
              },
              {
                  "value": "运城学院 982",
                  "label": "运城学院"
              },
              {
                  "value": "长治医学院 983",
                  "label": "长治医学院"
              },
              {
                  "value": "山西中医学院 984",
                  "label": "山西中医学院"
              },
              {
                  "value": "太原工业学院 985",
                  "label": "太原工业学院"
              },
              {
                  "value": "山西财经大学 986",
                  "label": "山西财经大学"
              },
              {
                  "value": "山西大同大学 987",
                  "label": "山西大同大学"
              },
              {
                  "value": "山西师范大学 988",
                  "label": "山西师范大学"
              },
              {
                  "value": "山西医科大学 989",
                  "label": "山西医科大学"
              },
              {
                  "value": "山西农业大学 990",
                  "label": "山西农业大学"
              },
              {
                  "value": "太原科技大学 991",
                  "label": "太原科技大学"
              },
              {
                  "value": "山西大学 993",
                  "label": "山西大学"
              },
              {
                  "value": "山西能源学院 994",
                  "label": "山西能源学院"
              },
              {
                  "value": "太原学院 995",
                  "label": "太原学院"
              },
              {
                  "value": "山西警察学院 996",
                  "label": "山西警察学院"
              },
              {
                  "value": "山西应用科技学院 998",
                  "label": "山西应用科技学院"
              },
              {
                  "value": "山西工商学院 999",
                  "label": "山西工商学院"
              },
              {
                  "value": "山西师范大学现代文理学院 1000",
                  "label": "山西师范大学现代文理学院"
              }
          ]
      },
      {
          "value": "广西壮族自治区",
          "label": "广西壮族自治区",
          "children": [
              {
                  "value": "广西民族大学 47",
                  "label": "广西民族大学"
              },
              {
                  "value": "桂林理工大学 75",
                  "label": "桂林理工大学"
              },
              {
                  "value": "桂林电子科技大学 94",
                  "label": "桂林电子科技大学"
              },
              {
                  "value": "桂林旅游学院 1290",
                  "label": "桂林旅游学院"
              },
              {
                  "value": "广西科技师范学院 1291",
                  "label": "广西科技师范学院"
              },
              {
                  "value": "桂林航天工业学院 1292",
                  "label": "桂林航天工业学院"
              },
              {
                  "value": "广西民族师范学院 1293",
                  "label": "广西民族师范学院"
              },
              {
                  "value": "梧州学院 1294",
                  "label": "梧州学院"
              },
              {
                  "value": "贺州学院 1295",
                  "label": "贺州学院"
              },
              {
                  "value": "钦州学院 1296",
                  "label": "钦州学院"
              },
              {
                  "value": "百色学院 1297",
                  "label": "百色学院"
              },
              {
                  "value": "广西艺术学院 1298",
                  "label": "广西艺术学院"
              },
              {
                  "value": "广西财经学院 1299",
                  "label": "广西财经学院"
              },
              {
                  "value": "玉林师范学院 1300",
                  "label": "玉林师范学院"
              },
              {
                  "value": "桂林医学院 1301",
                  "label": "桂林医学院"
              },
              {
                  "value": "广西中医药大学 1302",
                  "label": "广西中医药大学"
              },
              {
                  "value": "广西科技大学 1303",
                  "label": "广西科技大学"
              },
              {
                  "value": "广西师范大学 1306",
                  "label": "广西师范大学"
              },
              {
                  "value": "广西医科大学 1307",
                  "label": "广西医科大学"
              },
              {
                  "value": "广西大学 1309",
                  "label": "广西大学"
              },
              {
                  "value": "河池学院 1310",
                  "label": "河池学院"
              },
              {
                  "value": "广西师范学院 1311",
                  "label": "广西师范学院"
              },
              {
                  "value": "右江民族医学院 1312",
                  "label": "右江民族医学院"
              },
              {
                  "value": "桂林空军学院 1313",
                  "label": "桂林空军学院"
              },
              {
                  "value": "南宁学院 1314",
                  "label": "南宁学院"
              },
              {
                  "value": "广西警察学院 1315",
                  "label": "广西警察学院"
              },
              {
                  "value": "广西科技大学鹿山学院 1316",
                  "label": "广西科技大学鹿山学院"
              },
              {
                  "value": "广西大学行健文理学院 1317",
                  "label": "广西大学行健文理学院"
              },
              {
                  "value": "广西师范大学漓江学院 1318",
                  "label": "广西师范大学漓江学院"
              },
              {
                  "value": "桂林理工大学博文管理学院 1319",
                  "label": "桂林理工大学博文管理学院"
              },
              {
                  "value": "桂林电子科技大学信息科技学院 1964",
                  "label": "桂林电子科技大学信息科技学院"
              }
          ]
      },
      {
          "value": "吉林省",
          "label": "吉林省",
          "children": [
              {
                  "value": "郑州大学软件与应用科技学院 20",
                  "label": "郑州大学软件与应用科技学院"
              },
              {
                  "value": "吉林农业科技学院 59",
                  "label": "吉林农业科技学院"
              },
              {
                  "value": "吉林师范大学博达学院 80",
                  "label": "吉林师范大学博达学院"
              },
              {
                  "value": "东北师范大学 171",
                  "label": "东北师范大学"
              },
              {
                  "value": "通化师范学院 172",
                  "label": "通化师范学院"
              },
              {
                  "value": "长春工业大学 173",
                  "label": "长春工业大学"
              },
              {
                  "value": "长春理工大学 174",
                  "label": "长春理工大学"
              },
              {
                  "value": "吉林师范大学 175",
                  "label": "吉林师范大学"
              },
              {
                  "value": "吉林大学 176",
                  "label": "吉林大学"
              },
              {
                  "value": "空军航空大学 274",
                  "label": "空军航空大学"
              },
              {
                  "value": "长春大学 276",
                  "label": "长春大学"
              },
              {
                  "value": "北华大学 278",
                  "label": "北华大学"
              },
              {
                  "value": "吉林医药学院 280",
                  "label": "吉林医药学院"
              },
              {
                  "value": "长春建筑学院 281",
                  "label": "长春建筑学院"
              },
              {
                  "value": "吉林工商学院 282",
                  "label": "吉林工商学院"
              },
              {
                  "value": "吉林财经大学 283",
                  "label": "吉林财经大学"
              },
              {
                  "value": "长春光华学院 285",
                  "label": "长春光华学院"
              },
              {
                  "value": "吉林建筑大学 286",
                  "label": "吉林建筑大学"
              },
              {
                  "value": "长春理工大学光电信息学院 288",
                  "label": "长春理工大学光电信息学院"
              },
              {
                  "value": "吉林工程技术师范学院 289",
                  "label": "吉林工程技术师范学院"
              },
              {
                  "value": "长春师范大学 290",
                  "label": "长春师范大学"
              },
              {
                  "value": "吉林建筑大学城建学院 291",
                  "label": "吉林建筑大学城建学院"
              },
              {
                  "value": "长春工业大学人文信息学院 293",
                  "label": "长春工业大学人文信息学院"
              },
              {
                  "value": "吉林省经济管理干部学院 294",
                  "label": "吉林省经济管理干部学院"
              },
              {
                  "value": "东北电力大学 295",
                  "label": "东北电力大学"
              },
              {
                  "value": "吉林电子信息职业技术学院 296",
                  "label": "吉林电子信息职业技术学院"
              },
              {
                  "value": "长春职业技术学院 297",
                  "label": "长春职业技术学院"
              },
              {
                  "value": "长春工程学院 298",
                  "label": "长春工程学院"
              },
              {
                  "value": "长春科技学院 300",
                  "label": "长春科技学院"
              },
              {
                  "value": "吉林农业大学 302",
                  "label": "吉林农业大学"
              },
              {
                  "value": "中国人民解放军装甲兵技术学院 1477",
                  "label": "中国人民解放军装甲兵技术学院"
              },
              {
                  "value": "吉林警察学院 1478",
                  "label": "吉林警察学院"
              },
              {
                  "value": "吉林艺术学院 1479",
                  "label": "吉林艺术学院"
              },
              {
                  "value": "吉林体育学院 1480",
                  "label": "吉林体育学院"
              },
              {
                  "value": "白城师范学院 1483",
                  "label": "白城师范学院"
              },
              {
                  "value": "吉林化工学院 1488",
                  "label": "吉林化工学院"
              },
              {
                  "value": "长春中医药大学 1494",
                  "label": "长春中医药大学"
              },
              {
                  "value": "延边大学 1498",
                  "label": "延边大学"
              },
              {
                  "value": "中国人民解放军空军航空大学 1504",
                  "label": "中国人民解放军空军航空大学"
              },
              {
                  "value": "长春财经学院 1507",
                  "label": "长春财经学院"
              },
              {
                  "value": "吉林动画学院 1509",
                  "label": "吉林动画学院"
              },
              {
                  "value": "吉林华桥外国语学院 1510",
                  "label": "吉林华桥外国语学院"
              },
              {
                  "value": "东北师范大学人文学院 1822",
                  "label": "东北师范大学人文学院"
              }
          ]
      },
      {
          "value": "陕西省",
          "label": "陕西省",
          "children": [
              {
                  "value": "西安邮电大学 65",
                  "label": "西安邮电大学"
              },
              {
                  "value": "西安欧亚学院 67",
                  "label": "西安欧亚学院"
              },
              {
                  "value": "西安理工大学 208",
                  "label": "西安理工大学"
              },
              {
                  "value": "陕西师范大学 209",
                  "label": "陕西师范大学"
              },
              {
                  "value": "陕西科技大学 210",
                  "label": "陕西科技大学"
              },
              {
                  "value": "西北大学 211",
                  "label": "西北大学"
              },
              {
                  "value": "西安电子科技大学 212",
                  "label": "西安电子科技大学"
              },
              {
                  "value": "西北农林科技大学 213",
                  "label": "西北农林科技大学"
              },
              {
                  "value": "长安大学 214",
                  "label": "长安大学"
              },
              {
                  "value": "西安交通大学 215",
                  "label": "西安交通大学"
              },
              {
                  "value": "西北工业大学 216",
                  "label": "西北工业大学"
              },
              {
                  "value": "西安陆军学院 1413",
                  "label": "西安陆军学院"
              },
              {
                  "value": "中国人民解放军第四军医大学 1414",
                  "label": "中国人民解放军第四军医大学"
              },
              {
                  "value": "中国人民解放军西安通信学院 1415",
                  "label": "中国人民解放军西安通信学院"
              },
              {
                  "value": "西安航空学院 1416",
                  "label": "西安航空学院"
              },
              {
                  "value": "第四军医大学 1417",
                  "label": "第四军医大学"
              },
              {
                  "value": "陕西学前师范学院 1424",
                  "label": "陕西学前师范学院"
              },
              {
                  "value": "商洛学院 1425",
                  "label": "商洛学院"
              },
              {
                  "value": "安康学院 1426",
                  "label": "安康学院"
              },
              {
                  "value": "西安文理学院 1427",
                  "label": "西安文理学院"
              },
              {
                  "value": "西安音乐学院 1428",
                  "label": "西安音乐学院"
              },
              {
                  "value": "西安美术学院 1429",
                  "label": "西安美术学院"
              },
              {
                  "value": "西安体育学院 1430",
                  "label": "西安体育学院"
              },
              {
                  "value": "西北政法大学 1431",
                  "label": "西北政法大学"
              },
              {
                  "value": "西安财经学院 1432",
                  "label": "西安财经学院"
              },
              {
                  "value": "西安医学院 1433",
                  "label": "西安医学院"
              },
              {
                  "value": "西安外国语大学 1435",
                  "label": "西安外国语大学"
              },
              {
                  "value": "西安工业大学 1436",
                  "label": "西安工业大学"
              },
              {
                  "value": "西安工程大学 1437",
                  "label": "西安工程大学"
              },
              {
                  "value": "西安石油大学 1438",
                  "label": "西安石油大学"
              },
              {
                  "value": "西安科技大学 1439",
                  "label": "西安科技大学"
              },
              {
                  "value": "西安建筑科技大学 1442",
                  "label": "西安建筑科技大学"
              },
              {
                  "value": "延安大学 1444",
                  "label": "延安大学"
              },
              {
                  "value": "宝鸡文理学院 1446",
                  "label": "宝鸡文理学院"
              },
              {
                  "value": "咸阳师范学院 1447",
                  "label": "咸阳师范学院"
              },
              {
                  "value": "陕西理工大学 1448",
                  "label": "陕西理工大学"
              },
              {
                  "value": "榆林学院 1449",
                  "label": "榆林学院"
              },
              {
                  "value": "渭南师范学院 1450",
                  "label": "渭南师范学院"
              },
              {
                  "value": "陕西中医药大学 1451",
                  "label": "陕西中医药大学"
              },
              {
                  "value": "第二炮兵工程学院 1453",
                  "label": "第二炮兵工程学院"
              },
              {
                  "value": "空军工程大学 1454",
                  "label": "空军工程大学"
              },
              {
                  "value": "中国人民解放军西安政治学院 1455",
                  "label": "中国人民解放军西安政治学院"
              },
              {
                  "value": "中国人民武装警察部队工程学院 1456",
                  "label": "中国人民武装警察部队工程学院"
              },
              {
                  "value": "陕西服装工程学院 1457",
                  "label": "陕西服装工程学院"
              },
              {
                  "value": "西安交通工程学院 1458",
                  "label": "西安交通工程学院"
              },
              {
                  "value": "陕西国际商贸学院 1459",
                  "label": "陕西国际商贸学院"
              },
              {
                  "value": "西安思源学院 1460",
                  "label": "西安思源学院"
              },
              {
                  "value": "西安翻译学院 1461",
                  "label": "西安翻译学院"
              },
              {
                  "value": "西安外事学院 1462",
                  "label": "西安外事学院"
              },
              {
                  "value": "西安培华学院 1464",
                  "label": "西安培华学院"
              },
              {
                  "value": "西京学院 1465",
                  "label": "西京学院"
              },
              {
                  "value": "西安交通大学城市学院 1466",
                  "label": "西安交通大学城市学院"
              }
          ]
      },
      {
          "value": "重庆市",
          "label": "重庆市",
          "children": [
              {
                  "value": "重庆邮电大学 66",
                  "label": "重庆邮电大学"
              },
              {
                  "value": "重庆邮电大学移通学院 83",
                  "label": "重庆邮电大学移通学院"
              },
              {
                  "value": "长江师范学院 97",
                  "label": "长江师范学院"
              },
              {
                  "value": "重庆大学 244",
                  "label": "重庆大学"
              },
              {
                  "value": "中国人民解放军重庆通信学院 774",
                  "label": "中国人民解放军重庆通信学院"
              },
              {
                  "value": "重庆警察学院 775",
                  "label": "重庆警察学院"
              },
              {
                  "value": "重庆文理学院 776",
                  "label": "重庆文理学院"
              },
              {
                  "value": "重庆三峡学院 777",
                  "label": "重庆三峡学院"
              },
              {
                  "value": "四川美术学院 778",
                  "label": "四川美术学院"
              },
              {
                  "value": "四川外国语大学 779",
                  "label": "四川外国语大学"
              },
              {
                  "value": "重庆理工大学 781",
                  "label": "重庆理工大学"
              },
              {
                  "value": "重庆科技学院 782",
                  "label": "重庆科技学院"
              },
              {
                  "value": "西南政法大学 783",
                  "label": "西南政法大学"
              },
              {
                  "value": "重庆工商大学 784",
                  "label": "重庆工商大学"
              },
              {
                  "value": "重庆师范大学 785",
                  "label": "重庆师范大学"
              },
              {
                  "value": "重庆医科大学 786",
                  "label": "重庆医科大学"
              },
              {
                  "value": "重庆交通大学 788",
                  "label": "重庆交通大学"
              },
              {
                  "value": "西南大学 789",
                  "label": "西南大学"
              },
              {
                  "value": "重庆第二师范学院 790",
                  "label": "重庆第二师范学院"
              },
              {
                  "value": "中国人民解放军第三军医大学 792",
                  "label": "中国人民解放军第三军医大学"
              },
              {
                  "value": "中国人民解放军后勤工程学院 793",
                  "label": "中国人民解放军后勤工程学院"
              },
              {
                  "value": "重庆工程学院 794",
                  "label": "重庆工程学院"
              },
              {
                  "value": "重庆人文科技学院 795",
                  "label": "重庆人文科技学院"
              },
              {
                  "value": "重庆工商大学融智学院 796",
                  "label": "重庆工商大学融智学院"
              },
              {
                  "value": "重庆师范大学涉外商贸学院 1820",
                  "label": "重庆师范大学涉外商贸学院"
              }
          ]
      },
      {
          "value": "内蒙古自治区",
          "label": "内蒙古自治区",
          "children": [
              {
                  "value": "内蒙古科技大学 78",
                  "label": "内蒙古科技大学"
              },
              {
                  "value": "内蒙古师范大学 194",
                  "label": "内蒙古师范大学"
              },
              {
                  "value": "内蒙古大学\r\n 272",
                  "label": "内蒙古大学\r\n"
              },
              {
                  "value": "内蒙古工业大学 273",
                  "label": "内蒙古工业大学"
              },
              {
                  "value": "内蒙古科技大学包头师范学院 284",
                  "label": "内蒙古科技大学包头师范学院"
              },
              {
                  "value": "内蒙古农业大学职业技术学院 292",
                  "label": "内蒙古农业大学职业技术学院"
              },
              {
                  "value": "内蒙古艺术学院 1573",
                  "label": "内蒙古艺术学院"
              },
              {
                  "value": "河套学院 1574",
                  "label": "河套学院"
              },
              {
                  "value": "内蒙古财经大学 1575",
                  "label": "内蒙古财经大学"
              },
              {
                  "value": "集宁师范学院 1576",
                  "label": "集宁师范学院"
              },
              {
                  "value": "赤峰学院 1577",
                  "label": "赤峰学院"
              },
              {
                  "value": "呼和浩特民族学院 1578",
                  "label": "呼和浩特民族学院"
              },
              {
                  "value": "内蒙古大学 1579",
                  "label": "内蒙古大学"
              },
              {
                  "value": "鄂尔多斯应用技术学院 1580",
                  "label": "鄂尔多斯应用技术学院"
              },
              {
                  "value": "呼伦贝尔学院 1581",
                  "label": "呼伦贝尔学院"
              },
              {
                  "value": "内蒙古医科大学 1582",
                  "label": "内蒙古医科大学"
              },
              {
                  "value": "内蒙古农业大学 1584",
                  "label": "内蒙古农业大学"
              },
              {
                  "value": "内蒙古民族大学 1586",
                  "label": "内蒙古民族大学"
              }
          ]
      },
      {
          "value": "河北省",
          "label": "河北省",
          "children": [
              {
                  "value": "防灾科技学院 76",
                  "label": "防灾科技学院"
              },
              {
                  "value": "北京交通大学海滨学院 82",
                  "label": "北京交通大学海滨学院"
              },
              {
                  "value": "东北大学秦皇岛分校 135",
                  "label": "东北大学秦皇岛分校"
              },
              {
                  "value": "河北化工医药职业技术学院 797",
                  "label": "河北化工医药职业技术学院"
              },
              {
                  "value": "石家庄机械化步兵学院 798",
                  "label": "石家庄机械化步兵学院"
              },
              {
                  "value": "中国人民解放军军械工程学院 799",
                  "label": "中国人民解放军军械工程学院"
              },
              {
                  "value": "炮兵指挥学院 800",
                  "label": "炮兵指挥学院"
              },
              {
                  "value": "石家庄陆军指挥学院 801",
                  "label": "石家庄陆军指挥学院"
              },
              {
                  "value": "张家口学院 802",
                  "label": "张家口学院"
              },
              {
                  "value": "河北中医学院 803",
                  "label": "河北中医学院"
              },
              {
                  "value": "河北水利电力学院 804",
                  "label": "河北水利电力学院"
              },
              {
                  "value": "河北民族师范学院 805",
                  "label": "河北民族师范学院"
              },
              {
                  "value": "邯郸学院 806",
                  "label": "邯郸学院"
              },
              {
                  "value": "河北北方学院 807",
                  "label": "河北北方学院"
              },
              {
                  "value": "唐山学院 808",
                  "label": "唐山学院"
              },
              {
                  "value": "衡水学院 809",
                  "label": "衡水学院"
              },
              {
                  "value": "保定学院 810",
                  "label": "保定学院"
              },
              {
                  "value": "石家庄学院 811",
                  "label": "石家庄学院"
              },
              {
                  "value": "河北体育学院 812",
                  "label": "河北体育学院"
              },
              {
                  "value": "河北金融学院 813",
                  "label": "河北金融学院"
              },
              {
                  "value": "唐山师范学院 814",
                  "label": "唐山师范学院"
              },
              {
                  "value": "廊坊师范学院 815",
                  "label": "廊坊师范学院"
              },
              {
                  "value": "邢台学院 816",
                  "label": "邢台学院"
              },
              {
                  "value": "河北科技师范学院 817",
                  "label": "河北科技师范学院"
              },
              {
                  "value": "河北建筑工程学院 818",
                  "label": "河北建筑工程学院"
              },
              {
                  "value": "石家庄铁道大学 819",
                  "label": "石家庄铁道大学"
              },
              {
                  "value": "华北科技学院 820",
                  "label": "华北科技学院"
              },
              {
                  "value": "中国人民武装警察部队学院 822",
                  "label": "中国人民武装警察部队学院"
              },
              {
                  "value": "中央司法警官学院 823",
                  "label": "中央司法警官学院"
              },
              {
                  "value": "河北经贸大学 827",
                  "label": "河北经贸大学"
              },
              {
                  "value": "河北师范大学 828",
                  "label": "河北师范大学"
              },
              {
                  "value": "河北医科大学 829",
                  "label": "河北医科大学"
              },
              {
                  "value": "河北农业大学 830",
                  "label": "河北农业大学"
              },
              {
                  "value": "河北工程大学 831",
                  "label": "河北工程大学"
              },
              {
                  "value": "燕山大学 832",
                  "label": "燕山大学"
              },
              {
                  "value": "河北工业大学 833",
                  "label": "河北工业大学"
              },
              {
                  "value": "河北大学 834",
                  "label": "河北大学"
              },
              {
                  "value": "河北环境工程学院 835",
                  "label": "河北环境工程学院"
              },
              {
                  "value": "沧州师范学院 836",
                  "label": "沧州师范学院"
              },
              {
                  "value": "承德医学院 837",
                  "label": "承德医学院"
              },
              {
                  "value": "河北地质大学 838",
                  "label": "河北地质大学"
              },
              {
                  "value": "北华航天工业学院 839",
                  "label": "北华航天工业学院"
              },
              {
                  "value": "河北科技大学 840",
                  "label": "河北科技大学"
              },
              {
                  "value": "华北理工大学 841",
                  "label": "华北理工大学"
              },
              {
                  "value": "燕京理工学院 842",
                  "label": "燕京理工学院"
              },
              {
                  "value": "河北东方学院 843",
                  "label": "河北东方学院"
              },
              {
                  "value": "河北外国语学院 844",
                  "label": "河北外国语学院"
              },
              {
                  "value": "河北科技学院 845",
                  "label": "河北科技学院"
              },
              {
                  "value": "河北传媒学院 846",
                  "label": "河北传媒学院"
              },
              {
                  "value": "河北工程技术学院 847",
                  "label": "河北工程技术学院"
              },
              {
                  "value": "河北美术学院 848",
                  "label": "河北美术学院"
              },
              {
                  "value": "燕山大学里仁学院 849",
                  "label": "燕山大学里仁学院"
              },
              {
                  "value": "华北理工大学冀唐学院 850",
                  "label": "华北理工大学冀唐学院"
              },
              {
                  "value": "北京中医药大学东方学院 851",
                  "label": "北京中医药大学东方学院"
              },
              {
                  "value": "河北科技大学理工学院 852",
                  "label": "河北科技大学理工学院"
              },
              {
                  "value": "华北理工大学轻工学院 853",
                  "label": "华北理工大学轻工学院"
              },
              {
                  "value": "华北电力大学科技学院 1821",
                  "label": "华北电力大学科技学院"
              },
              {
                  "value": "唐山职业技术学院 1823",
                  "label": "唐山职业技术学院"
              },
              {
                  "value": "保定电力职业技术学院 1826",
                  "label": "保定电力职业技术学院"
              },
              {
                  "value": "保定职业技术学院 1827",
                  "label": "保定职业技术学院"
              },
              {
                  "value": "河北交通职业技术学院 1828",
                  "label": "河北交通职业技术学院"
              },
              {
                  "value": "石家庄财经职业学院 1829",
                  "label": "石家庄财经职业学院"
              },
              {
                  "value": "唐山工业职业技术学院 1830",
                  "label": "唐山工业职业技术学院"
              },
              {
                  "value": "石家庄邮电职业技术学院 1831",
                  "label": "石家庄邮电职业技术学院"
              },
              {
                  "value": "华北电力大学(保定) 1897",
                  "label": "华北电力大学(保定)"
              },
              {
                  "value": "河北地质职工大学 1898",
                  "label": "河北地质职工大学"
              },
              {
                  "value": "石家庄职工大学 1899",
                  "label": "石家庄职工大学"
              },
              {
                  "value": "河北青年管理干部学院 1900",
                  "label": "河北青年管理干部学院"
              },
              {
                  "value": "河北师范大学汇华学院 1901",
                  "label": "河北师范大学汇华学院"
              },
              {
                  "value": "河北经贸大学经济管理学院 1902",
                  "label": "河北经贸大学经济管理学院"
              },
              {
                  "value": "河北医科大学临床学院 1903",
                  "label": "河北医科大学临床学院"
              },
              {
                  "value": "河北工程大学科信学院 1904",
                  "label": "河北工程大学科信学院"
              },
              {
                  "value": "石家庄铁道大学四方学院 1905",
                  "label": "石家庄铁道大学四方学院"
              },
              {
                  "value": "河北地质大学华信学院 1906",
                  "label": "河北地质大学华信学院"
              },
              {
                  "value": "河北农业大学现代科技学院 1907",
                  "label": "河北农业大学现代科技学院"
              },
              {
                  "value": "河北司法警官职业学院 1908",
                  "label": "河北司法警官职业学院"
              },
              {
                  "value": "沧州医学高等专科学校 1909",
                  "label": "沧州医学高等专科学校"
              },
              {
                  "value": "河北女子职业技术学院 1910",
                  "label": "河北女子职业技术学院"
              },
              {
                  "value": "中国地质大学长城学院 1911",
                  "label": "中国地质大学长城学院"
              },
              {
                  "value": "石家庄医学高等专科学校 1912",
                  "label": "石家庄医学高等专科学校"
              },
              {
                  "value": "石家庄经济职业学院 1913",
                  "label": "石家庄经济职业学院"
              },
              {
                  "value": "冀中职业学院 1914",
                  "label": "冀中职业学院"
              },
              {
                  "value": "石家庄人民医学高等专科学校 1915",
                  "label": "石家庄人民医学高等专科学校"
              },
              {
                  "value": "石家庄信息工程职业学院 1916",
                  "label": "石家庄信息工程职业学院"
              },
              {
                  "value": "河北外国语职业学院 1917",
                  "label": "河北外国语职业学院"
              },
              {
                  "value": "河北机电职业技术学院 1918",
                  "label": "河北机电职业技术学院"
              },
              {
                  "value": "渤海石油职业学院 1919",
                  "label": "渤海石油职业学院"
              },
              {
                  "value": "廊坊职业技术学院 1920",
                  "label": "廊坊职业技术学院"
              },
              {
                  "value": "唐山科技职业技术学院 1921",
                  "label": "唐山科技职业技术学院"
              },
              {
                  "value": "河北公安警察职业学院 1922",
                  "label": "河北公安警察职业学院"
              },
              {
                  "value": "石家庄工商职业学院 1923",
                  "label": "石家庄工商职业学院"
              },
              {
                  "value": "石家庄理工职业学院 1924",
                  "label": "石家庄理工职业学院"
              },
              {
                  "value": "石家庄科技信息职业学院 1925",
                  "label": "石家庄科技信息职业学院"
              },
              {
                  "value": "河北大学工商学院 1926",
                  "label": "河北大学工商学院"
              },
              {
                  "value": "石家庄科技工程职业学院 1927",
                  "label": "石家庄科技工程职业学院"
              },
              {
                  "value": "河北劳动关系职业学院 1928",
                  "label": "河北劳动关系职业学院"
              },
              {
                  "value": "石家庄科技职业学院 1929",
                  "label": "石家庄科技职业学院"
              },
              {
                  "value": "泊头职业学院 1930",
                  "label": "泊头职业学院"
              },
              {
                  "value": "宣化科技职业学院 1931",
                  "label": "宣化科技职业学院"
              },
              {
                  "value": "廊坊燕京职业技术学院 1932",
                  "label": "廊坊燕京职业技术学院"
              },
              {
                  "value": "承德护理职业学院 1933",
                  "label": "承德护理职业学院"
              },
              {
                  "value": "石家庄幼儿师范高等专科学校 1934",
                  "label": "石家庄幼儿师范高等专科学校"
              },
              {
                  "value": "廊坊卫生职业学院 1935",
                  "label": "廊坊卫生职业学院"
              },
              {
                  "value": "河北轨道运输职业技术学院 1936",
                  "label": "河北轨道运输职业技术学院"
              },
              {
                  "value": "保定幼儿师范高等专科学校 1937",
                  "label": "保定幼儿师范高等专科学校"
              },
              {
                  "value": "河北工艺美术职业学院 1938",
                  "label": "河北工艺美术职业学院"
              },
              {
                  "value": "渤海理工职业学院 1939",
                  "label": "渤海理工职业学院"
              },
              {
                  "value": "唐山幼儿师范高等专科学校 1940",
                  "label": "唐山幼儿师范高等专科学校"
              },
              {
                  "value": "曹妃甸职业技术学院 1941",
                  "label": "曹妃甸职业技术学院"
              },
              {
                  "value": "河北工业职业技术学院 1942",
                  "label": "河北工业职业技术学院"
              },
              {
                  "value": "邯郸职业技术学院 1943",
                  "label": "邯郸职业技术学院"
              },
              {
                  "value": "石家庄职业技术学院 1944",
                  "label": "石家庄职业技术学院"
              },
              {
                  "value": "张家口职业技术学院 1945",
                  "label": "张家口职业技术学院"
              },
              {
                  "value": "承德石油高等专科学校 1946",
                  "label": "承德石油高等专科学校"
              },
              {
                  "value": "邢台职业技术学院 1947",
                  "label": "邢台职业技术学院"
              },
              {
                  "value": "邢台医学高等专科学校 1948",
                  "label": "邢台医学高等专科学校"
              },
              {
                  "value": "河北软件职业技术学院 1949",
                  "label": "河北软件职业技术学院"
              },
              {
                  "value": "河北石油职业技术学院 1950",
                  "label": "河北石油职业技术学院"
              },
              {
                  "value": "河北建材职业技术学院 1951",
                  "label": "河北建材职业技术学院"
              },
              {
                  "value": "河北政法职业学院 1952",
                  "label": "河北政法职业学院"
              },
              {
                  "value": "沧州职业技术学院 1953",
                  "label": "沧州职业技术学院"
              },
              {
                  "value": "河北能源职业技术学院 1954",
                  "label": "河北能源职业技术学院"
              },
              {
                  "value": "石家庄铁路职业技术学院 1955",
                  "label": "石家庄铁路职业技术学院"
              },
              {
                  "value": "秦皇岛职业技术学院 1956",
                  "label": "秦皇岛职业技术学院"
              },
              {
                  "value": "石家庄工程职业学院 1957",
                  "label": "石家庄工程职业学院"
              },
              {
                  "value": "石家庄城市经济职业学院 1958",
                  "label": "石家庄城市经济职业学院"
              },
              {
                  "value": "衡水职业技术学院 1959",
                  "label": "衡水职业技术学院"
              },
              {
                  "value": "河北艺术职业学院 1960",
                  "label": "河北艺术职业学院"
              },
              {
                  "value": "河北旅游职业学院 1961",
                  "label": "河北旅游职业学院"
              },
              {
                  "value": "东北石油大学秦皇岛分校 2057",
                  "label": "东北石油大学秦皇岛分校"
              },
              {
                  "value": "东秦 2065",
                  "label": "东秦"
              }
          ]
      },
      {
          "value": "黑龙江省",
          "label": "黑龙江省",
          "children": [
              {
                  "value": "哈尔滨工业大学(威海) 11",
                  "label": "哈尔滨工业大学(威海)"
              },
              {
                  "value": "哈尔滨华德学院 84",
                  "label": "哈尔滨华德学院"
              },
              {
                  "value": "哈尔滨理工大学 143",
                  "label": "哈尔滨理工大学"
              },
              {
                  "value": "黑龙江大学 144",
                  "label": "黑龙江大学"
              },
              {
                  "value": "哈尔滨商业大学 145",
                  "label": "哈尔滨商业大学"
              },
              {
                  "value": "东北林业大学 146",
                  "label": "东北林业大学"
              },
              {
                  "value": "哈尔滨工业大学 147",
                  "label": "哈尔滨工业大学"
              },
              {
                  "value": "哈尔滨工程大学 148",
                  "label": "哈尔滨工程大学"
              },
              {
                  "value": "大庆师范学院 149",
                  "label": "大庆师范学院"
              },
              {
                  "value": "东北农业大学 150",
                  "label": "东北农业大学"
              },
              {
                  "value": "黑龙江科技大学 271",
                  "label": "黑龙江科技大学"
              },
              {
                  "value": "牡丹江师范学院 277",
                  "label": "牡丹江师范学院"
              },
              {
                  "value": "黑龙江工程学院 299",
                  "label": "黑龙江工程学院"
              },
              {
                  "value": "佳木斯大学 301",
                  "label": "佳木斯大学"
              },
              {
                  "value": "哈尔滨师范大学 566",
                  "label": "哈尔滨师范大学"
              },
              {
                  "value": "哈尔滨体育学院 567",
                  "label": "哈尔滨体育学院"
              },
              {
                  "value": "哈尔滨学院 568",
                  "label": "哈尔滨学院"
              },
              {
                  "value": "哈尔滨医科大学 569",
                  "label": "哈尔滨医科大学"
              },
              {
                  "value": "哈尔滨音乐学院 570",
                  "label": "哈尔滨音乐学院"
              },
              {
                  "value": "黑河学院 571",
                  "label": "黑河学院"
              },
              {
                  "value": "黑龙江八一农垦大学 572",
                  "label": "黑龙江八一农垦大学"
              },
              {
                  "value": "黑龙江工业学院 573",
                  "label": "黑龙江工业学院"
              },
              {
                  "value": "黑龙江中医药大学 574",
                  "label": "黑龙江中医药大学"
              },
              {
                  "value": "牡丹江医学院 575",
                  "label": "牡丹江医学院"
              },
              {
                  "value": "齐齐哈尔大学 576",
                  "label": "齐齐哈尔大学"
              },
              {
                  "value": "齐齐哈尔医学院 577",
                  "label": "齐齐哈尔医学院"
              },
              {
                  "value": "绥化学院 578",
                  "label": "绥化学院"
              },
              {
                  "value": "哈尔滨金融学院 1589",
                  "label": "哈尔滨金融学院"
              },
              {
                  "value": "黑龙江工商学院 1599",
                  "label": "黑龙江工商学院"
              },
              {
                  "value": "哈尔滨信息工程学院 1600",
                  "label": "哈尔滨信息工程学院"
              },
              {
                  "value": "哈尔滨剑桥学院 1601",
                  "label": "哈尔滨剑桥学院"
              },
              {
                  "value": "黑龙江外国语学院 1603",
                  "label": "黑龙江外国语学院"
              },
              {
                  "value": "齐齐哈尔工程学院 1604",
                  "label": "齐齐哈尔工程学院"
              },
              {
                  "value": "哈尔滨石油学院 1605",
                  "label": "哈尔滨石油学院"
              },
              {
                  "value": "黑龙江东方学院 1606",
                  "label": "黑龙江东方学院"
              },
              {
                  "value": "黑龙江财经学院 1607",
                  "label": "黑龙江财经学院"
              },
              {
                  "value": "哈尔滨广厦学院 1608",
                  "label": "哈尔滨广厦学院"
              },
              {
                  "value": "哈尔滨远东理工学院 1609",
                  "label": "哈尔滨远东理工学院"
              },
              {
                  "value": "东北石油大学 1797",
                  "label": "东北石油大学"
              },
              {
                  "value": "大庆职业学院 2018",
                  "label": "大庆职业学院"
              },
              {
                  "value": "大兴安岭职业学院 2019",
                  "label": "大兴安岭职业学院"
              },
              {
                  "value": "哈尔滨城市职业学院 2020",
                  "label": "哈尔滨城市职业学院"
              },
              {
                  "value": "哈尔滨传媒职业学院 2021",
                  "label": "哈尔滨传媒职业学院"
              },
              {
                  "value": "哈尔滨电力职业技术学院 2022",
                  "label": "哈尔滨电力职业技术学院"
              },
              {
                  "value": "哈尔滨工程技术职业学院 2023",
                  "label": "哈尔滨工程技术职业学院"
              },
              {
                  "value": "哈尔滨科学技术职业学院 2024",
                  "label": "哈尔滨科学技术职业学院"
              },
              {
                  "value": "哈尔滨铁道职业技术学院 2025",
                  "label": "哈尔滨铁道职业技术学院"
              },
              {
                  "value": "哈尔滨应用职业技术学院 2026",
                  "label": "哈尔滨应用职业技术学院"
              },
              {
                  "value": "哈尔滨职业技术学院 2027",
                  "label": "哈尔滨职业技术学院"
              },
              {
                  "value": "鹤岗师范高等专科学校 2028",
                  "label": "鹤岗师范高等专科学校"
              },
              {
                  "value": "黑龙江工程学院昆仑旅游学院 2029",
                  "label": "黑龙江工程学院昆仑旅游学院"
              },
              {
                  "value": "黑龙江建筑职业技术学院 2030",
                  "label": "黑龙江建筑职业技术学院"
              },
              {
                  "value": "黑龙江交通职业技术学院 2031",
                  "label": "黑龙江交通职业技术学院"
              },
              {
                  "value": "黑龙江粮食职业学院 2032",
                  "label": "黑龙江粮食职业学院"
              },
              {
                  "value": "黑龙江林业职业技术学院 2033",
                  "label": "黑龙江林业职业技术学院"
              },
              {
                  "value": "黑龙江旅游职业技术学院 2034",
                  "label": "黑龙江旅游职业技术学院"
              },
              {
                  "value": "黑龙江民族职业学院 2035",
                  "label": "黑龙江民族职业学院"
              },
              {
                  "value": "黑龙江能源职业学院 2036",
                  "label": "黑龙江能源职业学院"
              },
              {
                  "value": "黑龙江农垦科技职业学院 2037",
                  "label": "黑龙江农垦科技职业学院"
              },
              {
                  "value": "黑龙江农垦职业学院 2038",
                  "label": "黑龙江农垦职业学院"
              },
              {
                  "value": "黑龙江农业工程职业学院 2039",
                  "label": "黑龙江农业工程职业学院"
              },
              {
                  "value": "黑龙江农业经济职业学院 2040",
                  "label": "黑龙江农业经济职业学院"
              },
              {
                  "value": "黑龙江农业职业技术学院 2041",
                  "label": "黑龙江农业职业技术学院"
              },
              {
                  "value": "黑龙江三江美术职业学院 2042",
                  "label": "黑龙江三江美术职业学院"
              },
              {
                  "value": "黑龙江商业职业学院 2043",
                  "label": "黑龙江商业职业学院"
              },
              {
                  "value": "黑龙江生态工程职业学院 2044",
                  "label": "黑龙江生态工程职业学院"
              },
              {
                  "value": "黑龙江生物科技职业学院 2045",
                  "label": "黑龙江生物科技职业学院"
              },
              {
                  "value": "黑龙江司法警官职业学院 2046",
                  "label": "黑龙江司法警官职业学院"
              },
              {
                  "value": "黑龙江信息技术职业学院 2047",
                  "label": "黑龙江信息技术职业学院"
              },
              {
                  "value": "黑龙江艺术职业学院 2048",
                  "label": "黑龙江艺术职业学院"
              },
              {
                  "value": "黑龙江幼儿师范高等专科学校 2049",
                  "label": "黑龙江幼儿师范高等专科学校"
              },
              {
                  "value": "黑龙江职业学院 2050",
                  "label": "黑龙江职业学院"
              },
              {
                  "value": "佳木斯职业学院 2051",
                  "label": "佳木斯职业学院"
              },
              {
                  "value": "牡丹江大学 2052",
                  "label": "牡丹江大学"
              },
              {
                  "value": "七台河职业学院 2053",
                  "label": "七台河职业学院"
              },
              {
                  "value": "齐齐哈尔高等师范专科学校 2054",
                  "label": "齐齐哈尔高等师范专科学校"
              },
              {
                  "value": "齐齐哈尔理工职业学院 2055",
                  "label": "齐齐哈尔理工职业学院"
              },
              {
                  "value": "伊春职业学院 2056",
                  "label": "伊春职业学院"
              }
          ]
      },
      {
          "value": "上海市",
          "label": "上海市",
          "children": [
              {
                  "value": "上海电机学院 87",
                  "label": "上海电机学院"
              },
              {
                  "value": "上海交通大学 217",
                  "label": "上海交通大学"
              },
              {
                  "value": "华东师范大学 218",
                  "label": "华东师范大学"
              },
              {
                  "value": "上海大学 219",
                  "label": "上海大学"
              },
              {
                  "value": "华东理工大学 220",
                  "label": "华东理工大学"
              },
              {
                  "value": "复旦大学 221",
                  "label": "复旦大学"
              },
              {
                  "value": "同济大学 222",
                  "label": "同济大学"
              },
              {
                  "value": "上海第二工业大学 223",
                  "label": "上海第二工业大学"
              },
              {
                  "value": "东华大学 224",
                  "label": "东华大学"
              },
              {
                  "value": "上海兴伟学院 736",
                  "label": "上海兴伟学院"
              },
              {
                  "value": "上海健康医学院 737",
                  "label": "上海健康医学院"
              },
              {
                  "value": "上海纽约大学 738",
                  "label": "上海纽约大学"
              },
              {
                  "value": "上海科技大学 739",
                  "label": "上海科技大学"
              },
              {
                  "value": "上海海关学院 740",
                  "label": "上海海关学院"
              },
              {
                  "value": "上海海洋大学 741",
                  "label": "上海海洋大学"
              },
              {
                  "value": "上海海事大学 742",
                  "label": "上海海事大学"
              },
              {
                  "value": "上海政法学院 743",
                  "label": "上海政法学院"
              },
              {
                  "value": "上海商学院 745",
                  "label": "上海商学院"
              },
              {
                  "value": "上海戏剧学院 746",
                  "label": "上海戏剧学院"
              },
              {
                  "value": "上海音乐学院 747",
                  "label": "上海音乐学院"
              },
              {
                  "value": "上海金融学院 748",
                  "label": "上海金融学院"
              },
              {
                  "value": "上海体育学院 749",
                  "label": "上海体育学院"
              },
              {
                  "value": "上海中医药大学 750",
                  "label": "上海中医药大学"
              },
              {
                  "value": "上海理工大学 751",
                  "label": "上海理工大学"
              },
              {
                  "value": "上海师范大学 752",
                  "label": "上海师范大学"
              },
              {
                  "value": "华东政法大学 753",
                  "label": "华东政法大学"
              },
              {
                  "value": "上海立信会计金融学院 754",
                  "label": "上海立信会计金融学院"
              },
              {
                  "value": "上海对外经贸大学 755",
                  "label": "上海对外经贸大学"
              },
              {
                  "value": "上海电力学院 756",
                  "label": "上海电力学院"
              },
              {
                  "value": "上海外国语大学 762",
                  "label": "上海外国语大学"
              },
              {
                  "value": "上海应用技术大学 765",
                  "label": "上海应用技术大学"
              },
              {
                  "value": "上海工程技术大学 766",
                  "label": "上海工程技术大学"
              },
              {
                  "value": "上海财经大学 767",
                  "label": "上海财经大学"
              },
              {
                  "value": "中国人民解放军第二军医大学 769",
                  "label": "中国人民解放军第二军医大学"
              },
              {
                  "value": "上海建桥学院 770",
                  "label": "上海建桥学院"
              },
              {
                  "value": "上海杉达学院 771",
                  "label": "上海杉达学院"
              },
              {
                  "value": "上海视觉艺术学院 772",
                  "label": "上海视觉艺术学院"
              },
              {
                  "value": "上海公安学院 773",
                  "label": "上海公安学院"
              }
          ]
      },
      {
          "value": "新疆维吾尔自治区",
          "label": "新疆维吾尔自治区",
          "children": [
              {
                  "value": "石河子大学 232",
                  "label": "石河子大学"
              },
              {
                  "value": "伊犁师范学院 1558",
                  "label": "伊犁师范学院"
              },
              {
                  "value": "喀什大学 1559",
                  "label": "喀什大学"
              },
              {
                  "value": "新疆师范大学 1560",
                  "label": "新疆师范大学"
              },
              {
                  "value": "新疆医科大学 1561",
                  "label": "新疆医科大学"
              },
              {
                  "value": "塔里木大学 1562",
                  "label": "塔里木大学"
              },
              {
                  "value": "新疆农业大学 1563",
                  "label": "新疆农业大学"
              },
              {
                  "value": "新疆大学 1564",
                  "label": "新疆大学"
              },
              {
                  "value": "新疆警察学院 1566",
                  "label": "新疆警察学院"
              },
              {
                  "value": "新疆工程学院 1567",
                  "label": "新疆工程学院"
              },
              {
                  "value": "昌吉学院 1568",
                  "label": "昌吉学院"
              },
              {
                  "value": "新疆艺术学院 1569",
                  "label": "新疆艺术学院"
              },
              {
                  "value": "新疆财经大学 1570",
                  "label": "新疆财经大学"
              },
              {
                  "value": "新疆大学科学技术学院 1571",
                  "label": "新疆大学科学技术学院"
              }
          ]
      },
      {
          "value": "甘肃省",
          "label": "甘肃省",
          "children": [
              {
                  "value": "西北民族大学 312",
                  "label": "西北民族大学"
              },
              {
                  "value": "兰州文理学院 1628",
                  "label": "兰州文理学院"
              },
              {
                  "value": "甘肃医学院 1629",
                  "label": "甘肃医学院"
              },
              {
                  "value": "兰州工业学院 1630",
                  "label": "兰州工业学院"
              },
              {
                  "value": "兰州大学 1631",
                  "label": "兰州大学"
              },
              {
                  "value": "甘肃民族师范学院 1632",
                  "label": "甘肃民族师范学院"
              },
              {
                  "value": "河西学院 1633",
                  "label": "河西学院"
              },
              {
                  "value": "兰州城市学院 1634",
                  "label": "兰州城市学院"
              },
              {
                  "value": "甘肃政法学院 1635",
                  "label": "甘肃政法学院"
              },
              {
                  "value": "兰州财经大学 1636",
                  "label": "兰州财经大学"
              },
              {
                  "value": "天水师范学院 1637",
                  "label": "天水师范学院"
              },
              {
                  "value": "陇东学院 1638",
                  "label": "陇东学院"
              },
              {
                  "value": "甘肃中医药大学 1639",
                  "label": "甘肃中医药大学"
              },
              {
                  "value": "西北师范大学 1640",
                  "label": "西北师范大学"
              },
              {
                  "value": "甘肃农业大学 1641",
                  "label": "甘肃农业大学"
              },
              {
                  "value": "兰州交通大学 1642",
                  "label": "兰州交通大学"
              },
              {
                  "value": "兰州理工大学 1643",
                  "label": "兰州理工大学"
              }
          ]
      },
      {
          "value": "云南省",
          "label": "云南省",
          "children": [
              {
                  "value": "昆明陆军学院 1320",
                  "label": "昆明陆军学院"
              },
              {
                  "value": "普洱学院 1321",
                  "label": "普洱学院"
              },
              {
                  "value": "滇西科技师范学院 1322",
                  "label": "滇西科技师范学院"
              },
              {
                  "value": "昭通学院 1323",
                  "label": "昭通学院"
              },
              {
                  "value": "保山学院 1324",
                  "label": "保山学院"
              },
              {
                  "value": "文山学院 1325",
                  "label": "文山学院"
              },
              {
                  "value": "昆明学院 1326",
                  "label": "昆明学院"
              },
              {
                  "value": "大理大学 1327",
                  "label": "大理大学"
              },
              {
                  "value": "云南艺术学院 1328",
                  "label": "云南艺术学院"
              },
              {
                  "value": "云南警官学院 1329",
                  "label": "云南警官学院"
              },
              {
                  "value": "云南中医学院 1330",
                  "label": "云南中医学院"
              },
              {
                  "value": "昆明医科大学 1331",
                  "label": "昆明医科大学"
              },
              {
                  "value": "西南林业大学 1332",
                  "label": "西南林业大学"
              },
              {
                  "value": "云南民族大学 1333",
                  "label": "云南民族大学"
              },
              {
                  "value": "云南财经大学 1334",
                  "label": "云南财经大学"
              },
              {
                  "value": "云南师范大学 1335",
                  "label": "云南师范大学"
              },
              {
                  "value": "云南农业大学 1336",
                  "label": "云南农业大学"
              },
              {
                  "value": "昆明理工大学 1337",
                  "label": "昆明理工大学"
              },
              {
                  "value": "云南大学 1338",
                  "label": "云南大学"
              },
              {
                  "value": "曲靖师范学院 1339",
                  "label": "曲靖师范学院"
              },
              {
                  "value": "玉溪师范学院 1340",
                  "label": "玉溪师范学院"
              },
              {
                  "value": "楚雄师范学院 1341",
                  "label": "楚雄师范学院"
              },
              {
                  "value": "红河学院 1342",
                  "label": "红河学院"
              },
              {
                  "value": "云南经济管理学院 1343",
                  "label": "云南经济管理学院"
              },
              {
                  "value": "云南工商学院 1344",
                  "label": "云南工商学院"
              },
              {
                  "value": "昆明理工大学津桥学院 1345",
                  "label": "昆明理工大学津桥学院"
              }
          ]
      },
      {
          "value": "贵州省",
          "label": "贵州省",
          "children": [
              {
                  "value": "贵州理工学院 1346",
                  "label": "贵州理工学院"
              },
              {
                  "value": "六盘水师范学院 1347",
                  "label": "六盘水师范学院"
              },
              {
                  "value": "兴义民族师范学院 1348",
                  "label": "兴义民族师范学院"
              },
              {
                  "value": "贵阳学院 1349",
                  "label": "贵阳学院"
              },
              {
                  "value": "安顺学院 1350",
                  "label": "安顺学院"
              },
              {
                  "value": "凯里学院 1351",
                  "label": "凯里学院"
              },
              {
                  "value": "铜仁学院 1352",
                  "label": "铜仁学院"
              },
              {
                  "value": "贵州民族大学 1353",
                  "label": "贵州民族大学"
              },
              {
                  "value": "贵州财经大学 1354",
                  "label": "贵州财经大学"
              },
              {
                  "value": "贵州工程应用技术学院 1355",
                  "label": "贵州工程应用技术学院"
              },
              {
                  "value": "遵义师范学院 1356",
                  "label": "遵义师范学院"
              },
              {
                  "value": "黔南民族师范学院 1357",
                  "label": "黔南民族师范学院"
              },
              {
                  "value": "贵州师范学院 1358",
                  "label": "贵州师范学院"
              },
              {
                  "value": "贵阳中医学院 1359",
                  "label": "贵阳中医学院"
              },
              {
                  "value": "遵义医学院 1360",
                  "label": "遵义医学院"
              },
              {
                  "value": "贵州医科大学 1361",
                  "label": "贵州医科大学"
              },
              {
                  "value": "贵州师范大学 1362",
                  "label": "贵州师范大学"
              },
              {
                  "value": "贵州大学 1363",
                  "label": "贵州大学"
              },
              {
                  "value": "贵州商学院 1364",
                  "label": "贵州商学院"
              },
              {
                  "value": "贵州大学科技学院 1365",
                  "label": "贵州大学科技学院"
              }
          ]
      },
      {
          "value": "青海省",
          "label": "青海省",
          "children": [
              {
                  "value": "青海民族大学 1467",
                  "label": "青海民族大学"
              },
              {
                  "value": "青海师范大学 1468",
                  "label": "青海师范大学"
              },
              {
                  "value": "青海大学 1469",
                  "label": "青海大学"
              },
              {
                  "value": "青海大学昆仑学院 1470",
                  "label": "青海大学昆仑学院"
              }
          ]
      },
      {
          "value": "宁夏自治区",
          "label": "宁夏自治区",
          "children": [
              {
                  "value": "宁夏师范学院 1471",
                  "label": "宁夏师范学院"
              },
              {
                  "value": "宁夏医科大学 1472",
                  "label": "宁夏医科大学"
              },
              {
                  "value": "北方民族大学 1473",
                  "label": "北方民族大学"
              },
              {
                  "value": "宁夏大学 1474",
                  "label": "宁夏大学"
              },
              {
                  "value": "宁夏理工学院 1475",
                  "label": "宁夏理工学院"
              },
              {
                  "value": "银川能源学院 1476",
                  "label": "银川能源学院"
              }
          ]
      },
      {
          "value": "西藏自治区",
          "label": "西藏自治区",
          "children": [
              {
                  "value": "西藏农牧学院 1554",
                  "label": "西藏农牧学院"
              },
              {
                  "value": "西藏民族大学 1555",
                  "label": "西藏民族大学"
              },
              {
                  "value": "西藏藏医学院 1556",
                  "label": "西藏藏医学院"
              },
              {
                  "value": "西藏大学 1557",
                  "label": "西藏大学"
              }
          ]
      },
      {
          "value": "海南省",
          "label": "海南省",
          "children": [
              {
                  "value": "琼台师范学院 1610",
                  "label": "琼台师范学院"
              },
              {
                  "value": "海南师范大学 1611",
                  "label": "海南师范大学"
              },
              {
                  "value": "海南热带海洋学院 1612",
                  "label": "海南热带海洋学院"
              },
              {
                  "value": "海南医学院 1613",
                  "label": "海南医学院"
              },
              {
                  "value": "海南大学 1614",
                  "label": "海南大学"
              },
              {
                  "value": "三亚学院 1615",
                  "label": "三亚学院"
              },
              {
                  "value": "海口经济学院 1616",
                  "label": "海口经济学院"
              }
          ]
      },
      {
          "value": "香港自治区",
          "label": "香港自治区",
          "children": [
              {
                  "value": "东华学院 1671",
                  "label": "东华学院"
              },
              {
                  "value": "恒生管理学院 1672",
                  "label": "恒生管理学院"
              },
              {
                  "value": "香港教育学院 1673",
                  "label": "香港教育学院"
              },
              {
                  "value": "香港岭南大学 1674",
                  "label": "香港岭南大学"
              },
              {
                  "value": "香港浸会大学 1675",
                  "label": "香港浸会大学"
              },
              {
                  "value": "香港中文大学 1676",
                  "label": "香港中文大学"
              },
              {
                  "value": "香港大学 1677",
                  "label": "香港大学"
              },
              {
                  "value": "香港城市大学 1678",
                  "label": "香港城市大学"
              },
              {
                  "value": "香港理工大学 1679",
                  "label": "香港理工大学"
              },
              {
                  "value": "香港科技大学 1680",
                  "label": "香港科技大学"
              }
          ]
      },
      {
          "value": "澳门自治区",
          "label": "澳门自治区",
          "children": [
              {
                  "value": "澳门城市大学 1681",
                  "label": "澳门城市大学"
              },
              {
                  "value": "澳门科技大学 1682",
                  "label": "澳门科技大学"
              },
              {
                  "value": "澳门大学 1683",
                  "label": "澳门大学"
              },
              {
                  "value": "澳门镜湖护理学院 1684",
                  "label": "澳门镜湖护理学院"
              },
              {
                  "value": "澳门旅游学院 1685",
                  "label": "澳门旅游学院"
              },
              {
                  "value": "澳门理工学院 1686",
                  "label": "澳门理工学院"
              }
          ]
      },
      {
          "value": "台湾省",
          "label": "台湾省",
          "children": [
              {
                  "value": "国立清华大学 1796",
                  "label": "国立清华大学"
              }
          ]
      },
      {
          "value": "中学组",
          "label": "中学组",
          "children": [
              {
                  "value": "雅礼中学 580",
                  "label": "雅礼中学"
              },
              {
                  "value": "长郡中学 581",
                  "label": "长郡中学"
              },
              {
                  "value": "成都第七中学 582",
                  "label": "成都第七中学"
              },
              {
                  "value": "南京外国语学校 583",
                  "label": "南京外国语学校"
              },
              {
                  "value": "中山纪念中学 584",
                  "label": "中山纪念中学"
              },
              {
                  "value": "厦门第一中学 585",
                  "label": "厦门第一中学"
              },
              {
                  "value": "厦门双十中学 586",
                  "label": "厦门双十中学"
              },
              {
                  "value": "安徽师范大学附属中学 587",
                  "label": "安徽师范大学附属中学"
              },
              {
                  "value": "乐成寄宿中学 588",
                  "label": "乐成寄宿中学"
              },
              {
                  "value": "杭州第十四中学 589",
                  "label": "杭州第十四中学"
              },
              {
                  "value": "慈溪市上林初级中学教育集团 590",
                  "label": "慈溪市上林初级中学教育集团"
              },
              {
                  "value": "衢州市实验学校 591",
                  "label": "衢州市实验学校"
              },
              {
                  "value": "杭州文海实验学校 592",
                  "label": "杭州文海实验学校"
              },
              {
                  "value": "杭州市建兰中学 593",
                  "label": "杭州市建兰中学"
              },
              {
                  "value": "杭州市文澜中学 594",
                  "label": "杭州市文澜中学"
              },
              {
                  "value": "余姚市实验学校 595",
                  "label": "余姚市实验学校"
              },
              {
                  "value": "杭州江南实验学校 596",
                  "label": "杭州江南实验学校"
              },
              {
                  "value": "杭州二中白马湖学校 597",
                  "label": "杭州二中白马湖学校"
              },
              {
                  "value": "杭州第二中学 598",
                  "label": "杭州第二中学"
              },
              {
                  "value": "温岭中学 599",
                  "label": "温岭中学"
              },
              {
                  "value": "衢州第二中学 600",
                  "label": "衢州第二中学"
              },
              {
                  "value": "金华第一中学 601",
                  "label": "金华第一中学"
              },
              {
                  "value": "镇海蛟川书院 602",
                  "label": "镇海蛟川书院"
              },
              {
                  "value": "镇海中学 603",
                  "label": "镇海中学"
              },
              {
                  "value": "慈溪中学 604",
                  "label": "慈溪中学"
              },
              {
                  "value": "温州中学 605",
                  "label": "温州中学"
              },
              {
                  "value": "绍兴市第一中学 606",
                  "label": "绍兴市第一中学"
              },
              {
                  "value": "学军中学 607",
                  "label": "学军中学"
              },
              {
                  "value": "余姚中学 608",
                  "label": "余姚中学"
              },
              {
                  "value": "义乌中学 1804",
                  "label": "义乌中学"
              },
              {
                  "value": "哈尔滨市第三中学 1810",
                  "label": "哈尔滨市第三中学"
              },
              {
                  "value": "佳木斯市第一中学 1811",
                  "label": "佳木斯市第一中学"
              },
              {
                  "value": "大庆第一中学 1812",
                  "label": "大庆第一中学"
              },
              {
                  "value": "大庆实验中学 1813",
                  "label": "大庆实验中学"
              },
              {
                  "value": "黑龙江省实验中学 1814",
                  "label": "黑龙江省实验中学"
              },
              {
                  "value": "哈尔滨师范大学附属中学 1815",
                  "label": "哈尔滨师范大学附属中学"
              },
              {
                  "value": "齐齐哈尔市实验中学 1816",
                  "label": "齐齐哈尔市实验中学"
              },
              {
                  "value": "牡丹江市第一中学 1817",
                  "label": "牡丹江市第一中学"
              },
              {
                  "value": "保定市第二中学 1824",
                  "label": "保定市第二中学"
              },
              {
                  "value": "河北隆尧第一中学 1825",
                  "label": "河北隆尧第一中学"
              },
              {
                  "value": "成都树德中学 1962",
                  "label": "成都树德中学"
              },
              {
                  "value": "长沙市第一中学 1963",
                  "label": "长沙市第一中学"
              },
              {
                  "value": "青竹湖湘一外国语学校 1966",
                  "label": "青竹湖湘一外国语学校"
              },
              {
                  "value": "湘一芙蓉中学 1967",
                  "label": "湘一芙蓉中学"
              },
              {
                  "value": "昌邑市第一中学 2059",
                  "label": "昌邑市第一中学"
              },
              {
                  "value": "苏州中学 2060",
                  "label": "苏州中学"
              },
              {
                  "value": "吉林一中 2061",
                  "label": "吉林一中"
              },
              {
                  "value": "昌邑市一中 2062",
                  "label": "昌邑市一中"
              }
          ]
      }
  ]
class Sq extends Component {
  constructor(props){
    super(props)
    
  }
  onChange=(value)=>{
    console.log(value)
    // province=value[0]
    school=value[1]
  }
     // 2、节流函数体
     throttle=(fn)=> {
        // 4、通过闭包保存一个标记
        let canRun = true;
        return function() {
          // 5、在函数开头判断标志是否为 true，不为 true 则中断函数
          if(!canRun) {
            return;
          }
          // 6、将 canRun 设置为 false，防止执行之前再被执行
          canRun = false;
          // 7、定时器
          setTimeout( () => {
            fn.call(this, arguments);
            // 8、执行完事件（比如调用完接口）之后，重新将这个标志设置为 true
            canRun = true;
          }, 6000);
        };
      }
    
      // 3、需要节流的事件
    
      
  handleSubmits = () => {
   if(flag===true){
       flag=false
       console.log(this.props)
       const datas={
        token:this.props.location.query.token,
        mobile:this.props.location.query.mobile
       }
       console.log(datas)
    axios("http://47.75.119.189/2050/getaccount",{
        method:'POST',
        data:{...datas}
      }).then(res=>{
        console.log(res)
        if(res.data.code!=0){
           message.error(res.data.message)
        }else{
          if(res.status===200){
            this.props.dispatch(
                routerRedux.push({
                  pathname:'/import',
                  query:{
                      token:this.props.location.query.token,
                    mobile:this.props.location.query.mobile,
                    data:{...res.data}
                  }
                })
              )
          }
        }
      })
   }
   setTimeout( () => {
    flag=true
   }, 6000);
  }
  
  handleSubmit = (e) => {
    this.setState({
      flag:true
    })
    e.preventDefault()
    this.props.form.validateFields((err, values) => {
      if (!err) {
      
       
        const datas={
          ...values,
          // school:abc,
          token:this.props.location.query.token,
          mobile:this.props.location.query.mobile
        }
        if(time===true){
            time=false
            axios("http://47.75.119.189/2050/requestapply",{
                method:'POST',
                data:{...datas}
              }).then((res)=>{
               if(res.data.code!=0){
                 message.error(res.data.message)
               }else{
                 if(res.status===200){
                  notification.open({
                    message: '申请通知',
                    description: '你已申请成功，结果将于4月15日公布',
                    
                  });
                 }
               }
      
              })
        }
        setTimeout( () => {
           time=true
           }, 6000);
         
       }
     })
  }
  render(){
    const {getFieldDecorator} =this.props.form
   
    return (
      <div className="login-form">
        <Card
      title="资助申请"
       extra={<span onClick={this.handleSubmits}>帐号查看</span>}
      style={{ width: 400 }}
    >
       <Form onSubmit={this.handleSubmit} >
 
         <FormItem label="金额">
          {getFieldDecorator('reason1', {
            rules: [{ required: true, message: '请输入拟申请金额' }]
          })(
            <Input  placeholder='请输入拟申请金额' />
          )}
        </FormItem>
        <FormItem label="个人简介">
          {getFieldDecorator('reason2', {
            rules: [{ required: true, message: '请输入个人简介' }]
          })(
            <TextArea rows={4} placeholder='请输入个人简介' />
          )}
        </FormItem>
        <FormItem label="参加活动理由">
          {getFieldDecorator('reason3', {
            rules: [{ required: true, message: '请输入参加活动理由' }]
          })(
            <TextArea rows={4} placeholder="请输入参加活动理由"/>
          )}
        </FormItem>
        <FormItem label="申请资助原因">
          {getFieldDecorator('reason4', {
            rules: [{ required: true, message: '请输入申请资助原因' }]
          })(
            <TextArea rows={4} placeholder="请输入申请资助原因"/>
          )}
        </FormItem>
      
      
        <FormItem>
          <Button type='primary' htmlType='submit' className='login-form-button'>
          提交
          </Button>
        </FormItem>

         </Form>
    </Card>
      </div>
    )
  }
}
export default connect(({ app }) => ({ app }))(Form.create()(Sq));